Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
// ============================================================
//  BAHÇE SULAMA - SU SEVİYE SİSTEMİ v12
//  ESP8266 12E (NodeMCU) + HC-SR04 + DS1307 RTC + EEPROM + LittleFS
//  + RS485 (ESP32-S3 Master ile haberlesme)
//  + Nano UART0 (kapı ve röle kontrolü)
// ============================================================

#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <Wire.h>
#include <RTClib.h>
#include <EEPROM.h>
#include <LittleFS.h>
#include <ArduinoOTA.h>
#include <ESP8266httpUpdate.h>
#include <WiFiClientSecureBearSSL.h>
#include <Updater.h>
#include <SoftwareSerial.h>
#include "config.h"
#include "web_content.h" // OTOMATIK URETILIR - bkz scripts/gen_web_content.py

// ============ WiFi AYARLARI (config.h) ============
// AP: SuDepo3T / 18811881 (her zaman acik)
// STA: config.h'dan STA_SSID / STA_PASSWORD

// ============ NESNELER ============
ESP8266WebServer server(80);
RTC_DS1307 rtc;
bool rtcHazir = false;

// ============ KAYIT DOSYALARI ============
const char* KAYIT_DOSYASI = "/kayitlar.csv";
const char* TUKETIM_DOSYASI = "/tuketim.csv";
const char* TUKETIM_GECMIS_DOSYASI = "/tuketim_gecmis.csv";

// ============ EEPROM AYARLARI ============
// EEPROM_SIZE config.h'dan gelir (512) - EEPROM_BOYUT yerine
// struct boyutu 512'den küçük olduğu için taşma olmaz.
// EEPROM_MAGIC config.h'den gelir (0xA543 - WiFi sıfırlama)

struct Ayarlar {
  uint16_t magic;
  float bosMesafe;
  float doluMesafe;
  float depoKapasiteLitre;
  float alarmSeviyeYuzde;
  uint8_t geceBaslangicSaat;
  uint8_t geceBitisSaat;
  uint16_t olcumAraligiGunduz;
  uint16_t olcumAraligiGece;
  float minDolumLitre;
  uint16_t kacakEsikDakika;
  uint8_t depoYatay;
  uint8_t alarmRoleAktif;
  uint8_t alarmTriggerGunduz;  // Gündüz alarm tetikleyicileri (bitmask)
  uint8_t alarmTriggerGece;    // Gece alarm tetikleyicileri (bitmask)
  uint8_t alarmMod;            // 1=Sesli 2=Sessiz 3=Onayli
  uint8_t alarmMaskSesli;      // Sesli mod senaryosu (bitmask)
  uint8_t alarmMaskSessiz;     // Sessiz mod senaryosu (bitmask)
  uint8_t alarmMaskOnayli;     // Onayli mod senaryosu (bitmask)
  uint8_t alarmSensorEtkin;    // Mod/zamandan BAGIMSIZ, her zaman gecerli genel sensor ac/kapa (ALARM_TRIGGER_* bitleri) - kablosuz/arizali sensoru tamamen devre disi birakmak icin
  uint8_t alarmOutputSesli;    // Sesli mod cikislari (bitmask: ALARM_OUTPUT_SIREN|ALARM_OUTPUT_LAMBA)
  uint8_t alarmOutputSessiz;   // Sessiz mod cikislari (bitmask) - varsayilan: sadece lamba
  uint8_t moistureAutomatic;
  uint8_t moistureThresholdLow;
  uint8_t moistureThresholdHigh;
  // SR501 her tetiklenmede ~3sn HIGH kalip ~5sn LOW'a duser (kendi kilitlenme
  // suresi), hareket surdukce bu dongu tekrarlar. Tek darbenin suresi
  // guvenilmez bir sinyal (Time potuna gore degisir), ama tek seferlik
  // gurultunun bir kez, gercek surekli hareketin ise ardarda birden fazla
  // darbe uretmesi guvenilir - bu yuzden pencere icindeki darbe SAYISINA
  // bakiyoruz (bkz. nanoStatusAyristir).
  uint8_t pirPencereSaniye;  // Bu sn'lik pencere icinde darbeler sayilir (0 = filtre yok, ham deger aninda gecerli)
  uint8_t pirMinTetiklenme;  // Pencere icinde PIR tetiklenmis sayilmasi icin gereken minimum ayri darbe sayisi
  // Siren kademeli zamanlama ayari (Konteyner/ESP32 ile ayni mantik, kullanici
  // talebi: "yanlis tetiklerden etkilenmemek icin"). Lamba bu ayarlardan
  // BAGIMSIZ, tetik aninda hemen yanar. Bkz asagidaki state machine (loop()).
  uint16_t sirenGecikmeSaniye;   // ilk chirp'e kadar bekleme (tetik baslangicindan itibaren)
  uint16_t sirenChirpMs;         // chirp suresi (ms)
  uint16_t sirenBeklemeSaniye;   // chirp/aktif-periyot sonrasi sessizlik
  uint16_t sirenAktifSaniye;     // dongudeki tam-aktif kalma suresi
};
Ayarlar ayar;

// WiFi (STA) bilgileri - ayri EEPROM bolgesi, Ayarlar struct'indan bagimsiz
// (bkz. config.h WIFI_EEPROM_ADDR aciklamasi)
struct WifiAyarlar {
  uint16_t magic;
  char ssid[32];
  char sifre[32];
};
WifiAyarlar wifiAyar;

void wifiAyarlariYukle() {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.get(WIFI_EEPROM_ADDR, wifiAyar);
  EEPROM.end();
  if (wifiAyar.magic != WIFI_EEPROM_MAGIC) {
    wifiAyar.magic = WIFI_EEPROM_MAGIC;
    wifiAyar.ssid[0] = '\0';
    wifiAyar.sifre[0] = '\0';
  } else {
    wifiAyar.ssid[31] = '\0';
    wifiAyar.sifre[31] = '\0';
  }
}

void wifiAyarlariKaydet() {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.put(WIFI_EEPROM_ADDR, wifiAyar);
  bool ok = EEPROM.commit();
  EEPROM.end();
  DEBUG_PRINTF("[EEPROM] WiFi kaydedildi: %s (SSID=%s, sifreVar=%d)\n", ok ? "OK" : "HATA", wifiAyar.ssid, strlen(wifiAyar.sifre) > 0);
}

void varsayilanAyarlar() {
  ayar.magic = EEPROM_MAGIC;
  ayar.bosMesafe = TANK_EMPTY_CM;
  ayar.doluMesafe = TANK_FULL_CM;
  ayar.depoKapasiteLitre = TANK_CAPACITY_LITERS;
  ayar.alarmSeviyeYuzde = ALARM_THRESHOLD_PERCENT;
  ayar.geceBaslangicSaat = NIGHT_START_HOUR;
  ayar.geceBitisSaat = NIGHT_END_HOUR;
  ayar.olcumAraligiGunduz = DAY_MEASURE_INTERVAL;
  ayar.olcumAraligiGece = NIGHT_MEASURE_INTERVAL;
  ayar.minDolumLitre = MIN_FILL_LITERS;
  ayar.kacakEsikDakika = LEAK_THRESHOLD_MINUTES;
  ayar.depoYatay = TANK_HORIZONTAL;
  ayar.alarmRoleAktif = 1;
  ayar.alarmTriggerGunduz = 0xFF;  // Varsayilan: tüm tetikleyiciler aktif
  ayar.alarmTriggerGece = 0xFF;    // Varsayilan: tüm tetikleyiciler aktif
  ayar.alarmMod = ALARM_MOD_SESLI;
  ayar.alarmMaskSesli = 0xFF;
  ayar.alarmMaskSessiz = 0xFF;
  ayar.alarmMaskOnayli = 0xFF;
  ayar.alarmSensorEtkin = 0xFF; // Varsayilan: tum sensorler aktif
  ayar.alarmOutputSesli = ALARM_OUTPUT_SIREN | ALARM_OUTPUT_LAMBA;
  ayar.alarmOutputSessiz = ALARM_OUTPUT_LAMBA;  // sessiz mod: siren yok, sadece lamba bildirimi
  ayar.moistureAutomatic = 0;
  ayar.moistureThresholdLow = 40;
  ayar.moistureThresholdHigh = 70;
  ayar.pirPencereSaniye = 10;
  ayar.pirMinTetiklenme = 2;
  ayar.sirenGecikmeSaniye = 5;
  ayar.sirenChirpMs = 300;
  ayar.sirenBeklemeSaniye = 10;
  ayar.sirenAktifSaniye = 5;
}

void ayarlariKaydet() {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.put(0, ayar);
  // FIX: commit() sonucu kontrol edilmiyordu; yazma hatasinda veri kaybi
  // fark edilmiyordu. Artik debug'ta gercek durum gorunur.
  bool ok = EEPROM.commit();
  EEPROM.end();
  DEBUG_PRINTF("[EEPROM] Kaydedildi: %s\n", ok ? "OK" : "HATA");
}

