Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
void ayarlariYukle() {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.get(0, ayar);
  EEPROM.end();
  DEBUG_PRINTF("[EEPROM] Yuklendi magic=0x%04X\n", ayar.magic);
  // FIX: magic bozuksa varsayilan ayarlarla basla (bozuk veri kullanimi engellenir).
  // WiFi bilgileri bu magic'e bagli degil, ayri yuklenir (bkz wifiAyarlariYukle).
  bool gecerli = (ayar.magic == EEPROM_MAGIC);
  if (!gecerli) {
    DEBUG_PRINTLN("[EEPROM] Magic uyusmazligi - varsayilan ayarlar yukleniyor");
    varsayilanAyarlar();
    ayarlariKaydet();
  } else {
    if (ayar.pirPencereSaniye > 120) ayar.pirPencereSaniye = 10; // eski firmware'den kalma gecersiz/bozuk deger
    // Ust sinir asagidaki PIR_DARBE_GECMISI_BOYUTU (8, satir ~220) ile
    // ESLESMELI - buyugu, sayac en fazla 8 olabildigi icin ASLA
    // tetiklenemeyen bir alarm demekti (bug). Define bu noktadan sonra
    // oldugundan (once kullanilamaz) literal 8 yazildi.
    if (ayar.pirMinTetiklenme == 0 || ayar.pirMinTetiklenme > 8) ayar.pirMinTetiklenme = 2;
  }
}

// ============ OLCUM DEGISKENLERI ============
float sonSeviyeCm = 0, sonYuzde = 0, sonLitre = 0;
String sonOlcumZamani = "-";

// ============ DOLUM TESPITI ============
// 2026-08-27 kullanici bulgusu: "Canli Izle" 2sn'de bir olctugunden, su
// yuzeyi dalgalanmasi/ultrasonik yankı gurultusu TEK ORNEKTE 100L'e varan
// sahte "ani dolum/bosalma" gibi gorunebiliyordu - bu da "Otomatik Tespit"
// kayitlarini (ve tuketim/kacak sayaclarini) gereksiz yere sisiriyordu.
// Iki onlem birden alindi: (1) karar mekanizmasi HAM ardisik farka degil,
// yumusatilmis (EMA) seviyeye bakar - ekrandaki ANLIK deger (sonLitre) BUNDAN
// ETKILENMEZ, sadece dolum/kacak/kayit KARARI icin ayri bir seviyeEMA
// tutulur; (2) bir dolum "bolumu" en az MIN_DOLUM_SURESI_MS surmeden
// Otomatik Tespit kaydi YAZILMAZ - gercek bir tanker/sebeke dolumu dakikalar
// surer, tek olcumluk bir sicrama olmaz.
#define NOISE_ESIK_LITRE 3.0
#define SEVIYE_EMA_AGIRLIK 0.25f
#define MIN_DOLUM_SURESI_MS (30UL * 1000UL)
bool ilkOlcumTamamlandi = false;
float seviyeEMA = 0;
bool dolumDevamEdiyor = false;
float dolumBaslangicLitre = 0, dolumSonPikLitre = 0;
unsigned long dolumBaslangicMs = 0;

// ============ TUKETIM ============
float gunlukTuketim = 0, aylikTuketim = 0;
String gunlukTarih = "", aylikYilAy = "";

// ============ KACAK ALARMI ============
bool kacakSuruyor = false, kacakAlarmi = false;
unsigned long kacakBaslangicMs = 0;
bool alarmAktif = false, sensorHatasi = false;
unsigned long sonOtomatikOlcumMs = 0;

// ============ ALARM MOD DURUMU ============
uint8_t alarmTetikleyenMask = 0; // O an alarmi tetikleyen sensor(ler) - bitmask, banner/uyarida gosterilir
bool alarmCikisLambaIstenen = false; // Bu dongude lamba flasinin acik olmasi gerekiyor mu (mod cikis ayarindan, MIN sure uygulandiktan SONRAKI nihai deger)
unsigned long lambaMinSureBaslangicMs = 0; // 0 = lamba hedefi su an kapali; !=0 ise bu andan itibaren LAMBA_MIN_SURE_MS boyunca lamba acik tutulur
#define LAMBA_MIN_SURE_MS (60UL * 1000UL) // Sustur/tetikleyici erken temizlense bile lamba en az bu kadar yanik kalir
bool alarmSusturuldu = false;   // Susturma - tetikleyici aktifken siren susturulur (mesaj/banner kalir)
unsigned long sirenEpisodeBaslangicMs = 0; // 0 = siren cikisi su an secili degil - HEM state machine referans ani HEM oto-sustur olcumu icin kullanilir (bkz asagidaki kademeli zamanlama deseni)
uint8_t sirenFaz = 0;              // 0=ilk gecikme,1=chirp,2=bekleme,3=aktif (Konteyner/ESP32 ile ayni mantik)
unsigned long sirenFazBaslangicMs = 0;
#define SIREN_MAX_SURE_MS (2UL * 60UL * 1000UL) // bu kadar kesintisiz calarsa (sensor arizasi ihtimaline karsi, Konteyner/ESP32 ile ayni deger) otomatik susturulur - ESP8266'nin Telegram'i olmadigindan bildirim gitmez, sadece susturulur
unsigned long lambaSurekliBaslangicMs = 0; // 0 = alarm-tetikli lamba su an surekli yanmiyor
#define LAMBA_MAX_SURE_MS (10UL * 60UL * 1000UL) // alarm-tetikli lamba (manuel haric) bu kadar kesintisiz yanarsa zorla soner - Konteyner/ESP32 ile ayni deger, enerji butcesi ust siniri
bool alarmOnayBekliyor = false; // Mod 3 (Onayli): tetiklendi, onay bekleniyor
bool alarmOnaylandi = false;    // Mod 3 (Onayli): onaylandi, sesli mod gibi davranir
bool alarmOnaySadeceLamba = false; // Mod 3 (Onayli): "sadece lamba" secildi - siren/role yok, sadece lamba flaşörü

// ============ ALARM LAMBA FLASI ============
// Alarm fiziksel olarak tetiklendiginde (role aktifken) depo lambasi da
// yanip sonerek gorsel uyari verir. Alarm bitince lambayi tetiklenmeden
// onceki (kullanicinin elle ayarladigi) durumuna geri dondurur.
#define LAMBA_FLASH_ARALIK_MS 400
bool lambaFlashAktif = false;
bool lambaFlashOncekiManuel = false;
unsigned long lambaFlashSonDegisimMs = 0;

// ============ PANIK MODU ============
bool panicAktif = false;  // Manuel panik override - anahtar gibi, acik/kapali kalir
bool panicRoleAktif = false;  // Panik modunda rolenin aktif olup olmadigi

// ============ SSE ============
WiFiClient sseClient;
bool sseAktif = false;

// ============ NANO VERISI ============
bool kapi1Acik = false, kapi2Acik = false;
bool pirAcik = false;           // PIR sensörü hareket algısı (ham deger)
// pirTetikleyici, pencere icinde en az ayar.pirMinTetiklenme kez ayri darbe
// olursa true olur (bkz nanoStatusAyristir).
bool pirTetikleyici = false;
// Konteyner (ESP32) zonundaki "on uyari" buzzer'iyla AYNI mantik (2026-08-27
// kullanici talebi): her yeni PIR hareket "bolumu" basladiginda (henuz gercek
// alarm degil) Nano'nun D12 pinine bagli PASIF buzzer'dan 1sn'lik kisa bir
// bip verilir - GERCEK bir alarm/siren zaten calmiyorsa (roleFizikselDurum
// false ise). Buzzer PASIF oldugundan (kendi osilatoru yok) digitalWrite
// yeterli degil - Nano'ya ozel TONE_PLAY komutu eklenip TEK SEFERLIK USB ile
// reflash edildi (bkz nano_io main.cpp). pinKorumali ile bu pin de korunuyor.
#define NANO_BUZZER_PIN 12
#define PIR_DARBE_GECMISI_BOYUTU 8
unsigned long pirDarbeGecmisi[PIR_DARBE_GECMISI_BOYUTU]; // en son darbelerin baslangic zamanlari (dairesel tampon)
uint8_t pirDarbeGecmisiIndex = 0; // pirDarbeGecmisi'nde bir sonraki yazilacak slot
uint8_t pirDarbeSayisiPencerede = 0; // debug/UI icin: su an pencere icinde kalan darbe sayisi
unsigned long pirSonAktifMs = 0; // PIR ham en son ne zaman aktif goruldu (iletisim toleransi icin)
bool roleFizikselDurum = false;
bool rolePolariteHigh = true;  // Nano GET_STATUS'tan gelir - dropdown gercek durumu yansitsin diye
bool nanoBaglantiVar = false;
bool lambaAcik = false;
bool moistureOutputActive = false;
int moistureRaw = 0;
float moisturePercent = 0.0;

// ============ RS485 ============
String sonRS485AlinanMsj = "(yok)";
unsigned long sonRS485AlinanMs = 0;

// ============ mDNS ============
// Hostname, WIFI_AP_SSID'den türetilir (küçük harf, boşluk -> "-")
// Böylece AP adı = mDNS hostname (örn "SuDepo" -> "sudepo.local")
bool mdnsAktif = false;
String mdnsHostname() {
  String h = String(WIFI_AP_SSID);
  h.toLowerCase();
  h.replace(" ", "-");
  return h;
}

