Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
        if (ayar.pirPencereSaniye == 0) {
          pirDarbeSayisiPencerede = pirAcik ? 1 : 0;
          pirTetikleyici = pirAcik; // filtre yok - ham deger aninda gecerli
        } else {
          unsigned long pencereMs = (unsigned long)ayar.pirPencereSaniye * 1000UL;
          uint8_t sayac = 0;
          for (uint8_t i = 0; i < PIR_DARBE_GECMISI_BOYUTU; i++) {
            unsigned long t = pirDarbeGecmisi[i];
            if (t != 0 && simdiPir - t <= pencereMs) sayac++;
          }
          pirDarbeSayisiPencerede = sayac;
          pirTetikleyici = (sayac >= ayar.pirMinTetiklenme);
        }
      }
      roleFizikselDurum  = (yanit.indexOf("RELE=1") >= 0);
      if (yanit.indexOf("POLARITY=") >= 0) rolePolariteHigh = (yanit.indexOf("POLARITY=1") >= 0);
      lambaAcik          = (yanit.indexOf("LAMBA=1") >= 0);
      moistureOutputActive = (yanit.indexOf("MOISTURE=1") >= 0);
      // NOT: Nano'nun GET_STATUS yanitindaki MOISTURE_RAW=/MOISTURE_PCT=
      // ARTIK OKUNMUYOR - gercek nem sensoru Nano'da degil, ESP8266'nin
      // kendi A0 pininde (bkz moistureOku()). Nano'nunkini buraya
      // yazdirmak, ESP8266'nin dogru yerel okumasini periyodik olarak
      // Nano'nun (baglanmamis) A0 gurultusuyle eziyordu - Kalburum
      // panelinde degerin "bir dogru bir en yuksek" sicramasinin sebebi buydu.
}

void nanoPoll() {
  static unsigned long son = 0;
  unsigned long simdi = millis();

  // --- Bekleyen komut varsa önce onu işle (retry dahil) ---
  if (pendingCmd.komut.length() > 0) {
    // Her 150ms'de bir retry (max 3 deneme)
    if (simdi - pendingCmd.sonGonderMs >= 150) {
      if (pendingCmd.deneme >= 3) {
        // 3 denemede de ACK gelmedi - vazgeç, durumu sorgula
        DEBUG_PRINTF("[NANO] RETRY BASARISIZ: %s\n", pendingCmd.komut.c_str());
        pendingCmd = {"", "", 0, 0};
        nanoMesgul = false;
      } else {
        // Serial buffer'ı temizle, komutu gönder
        while (Serial.available()) Serial.read();
        Serial.print(pendingCmd.komut + "\n");
        pendingCmd.deneme++;
        pendingCmd.sonGonderMs = simdi;
        DEBUG_PRINTF("[NANO] Gonderiliyor (deneme %d): %s\n", pendingCmd.deneme, pendingCmd.komut.c_str());

        // Yanıt bekle (80ms - Nano'nun 10ms loop'u + seri gecikme)
        String yanit = nanoYanitOku(80);
        if (yanit.length() > 0 && yanit.indexOf(pendingCmd.ackBeklenen) >= 0) {
          DEBUG_PRINTF("[NANO] ACK alindi: %s\n", yanit.c_str());
          pendingCmd = {"", "", 0, 0};
          nanoMesgul = false;
          son = simdi; // Poll timer'ı sıfırla
        }
        // ACK gelmedi -> bir sonraki döngüde tekrar denenecek
      }
    }
    return; // Pending komut varken GET_STATUS gönderme
  }

  // Buzzer hedefi (alarm rolesini izler) degistiyse GET_STATUS'tan ONCE
  // gonder - alarm sesi periyodik pollun arkasinda gecikmesin.
  nanoBuzzerKontrolPoll();
  if (pendingCmd.komut.length() > 0) return;

  // --- Periyodik GET_STATUS ---
  if (simdi - son < NANO_POLL_INTERVAL) return;
  son = simdi;

  while (Serial.available()) Serial.read(); // Temiz başla
  Serial.print("GET_STATUS\n");

  // FIX: GET_STATUS yaniti ~85 karakter - 9600 baud'da iletimi tek basina
  // ~90ms suruyor, Nano'nun kendi islem/loop gecikmesi eklenince eskiden
  // buradaki 80ms timeout neredeyse HER ZAMAN yetersiz kaliyordu. Yanit
  // kesiliyor, kuyrukta kalan baytlar asagidaki "temizle" adiminda TAM
  // temizlenemeden PIN_READ gonderiliyordu - bu da PIR okumasini sürekli
  // kirletiyordu (kapi/role/lamba yanitin baslarinda oldugu icin etkilenmiyordu).
  String yanit = nanoYanitOku(200);
  if (yanit.length() > 0) {
    nanoStatusAyristir(yanit);
  } else {
    nanoBaglantiVar = false;
  }
}

bool nanoLambaKontrol(bool ac) {
  // Retry kuyruğuna ekle - GET_STATUS ile çakışmayı önler
  // ACK formatı Nano ile eşleşmeli: "ACK:LAMBA_ON" / "ACK:LAMBA_OFF"
  String komut = ac ? "LAMBA_ON" : "LAMBA_OFF";
  String ack   = ac ? "ACK:LAMBA_ON" : "ACK:LAMBA_OFF";

  // Önceki pending komut varsa iptal et (yeni komut öncelikli)
  pendingCmd = {komut, ack, 0, 0};
  nanoMesgul = true;

  // Optimistik güncelle (UI hemen tepki versin)
  lambaAcik = ac;
  DEBUG_PRINTF("[NANO] Lamba komutu kuyruga alindi: %s\n", komut.c_str());
  return true; // Async - ACK loop'ta işlenecek
}

bool nanoMoistureKontrol(bool ac) {
  // ACK formatı: "ACK:MOISTURE_ON" / "ACK:MOISTURE_OFF"
  String komut = ac ? "MOISTURE_ON" : "MOISTURE_OFF";
  String ack   = ac ? "ACK:MOISTURE_ON" : "ACK:MOISTURE_OFF";

  pendingCmd = {komut, ack, 0, 0};
  nanoMesgul = true;

  moistureOutputActive = ac;
  DEBUG_PRINTF("[NANO] Moisture komutu kuyruga alindi: %s\n", komut.c_str());
  return true;
}

// D12'ye baglanan PASIF buzzer icin - digitalWrite (PIN_WRITE) sabit HIGH/LOW
// verir, pasif buzzer'in ses cikarmasi icin osilasyon (tone()) gerekir. Nano
// tarafina bunun icin ozel TONE_PLAY komutu eklendi (2026-08-27, tek seferlik
// USB reflash ile - genel PIN_WRITE API'si buna yetmiyordu). tone() Nano'da
// kendi zamanlayicisiyla otomatik durur, burada ayrica "kapat" komutu gerekmez.
#define BUZZER_CHIRP_FREKANS_HZ 2500
#define BUZZER_CHIRP_SURE_MS 1000
void nanoBuzzerChirp() {
  pendingCmd = {"TONE_PLAY:" + String(NANO_BUZZER_PIN) + "," + String(BUZZER_CHIRP_FREKANS_HZ) + "," + String(BUZZER_CHIRP_SURE_MS), "ACK:TONE_PLAY", 0, 0};
  nanoMesgul = true;
}

// Sudepo zonunda henuz ayri/harici bir siren cihazi YOK (2026-08-27) - alarm
// rolesi (D4, nanoRoleKontrol) su an hicbir sey calistirmiyor, tek sesli
// kaynak Nano'nun D12 pasif buzzer'i. Bu yuzden roleFizikselDurum'un HER
// degisimi (nanoRoleKontrol icinde) bu hedefi de guncelliyor, nanoPoll()
// pendingCmd bosken (GET_STATUS/diger komutlarla CAKISMADAN, tek-slot seri
// protokolune uygun) TONE_PLAY/TONE_STOP gonderiyor. Boylece siren FSM'inin
// (sirenFaz: gecikme/chirp/bekleme/aktif) zaten hesapladigi ac/kapa
// zamanlamasi dogrudan buzzer'da duyulur - harici siren eklendiginde bu
// bagimlilik kaldirilmaz, ikisi ayni anda calismaya devam eder.
#define BUZZER_ALARM_MAX_MS 130000UL // guvenlik ust siniri (en uzun sirenAktifSaniye=120s'i asar) - TONE_STOP normalde cok daha once gelir
bool buzzerHedefAktif = false;
bool buzzerSonGonderilenAktif = false;

