Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
void nanoBuzzerKontrolPoll() {
  if (pendingCmd.komut.length() > 0 || nanoMesgul) return; // tek-slot protokol - mevcut komutu ezme
  if (buzzerHedefAktif == buzzerSonGonderilenAktif) return;
  if (buzzerHedefAktif) {
    pendingCmd = {"TONE_PLAY:" + String(NANO_BUZZER_PIN) + "," + String(BUZZER_CHIRP_FREKANS_HZ) + "," + String(BUZZER_ALARM_MAX_MS), "ACK:TONE_PLAY", 0, 0};
  } else {
    pendingCmd = {"TONE_STOP:" + String(NANO_BUZZER_PIN), "ACK:TONE_STOP", 0, 0};
  }
  nanoMesgul = true;
  buzzerSonGonderilenAktif = buzzerHedefAktif;
}

void moistureOku() {
  moistureRaw = analogRead(A0);
  moisturePercent = 100.0 - (moistureRaw * 100.0 / 1023.0);
  if (moisturePercent < 0) moisturePercent = 0;
  if (moisturePercent > 100) moisturePercent = 100;
}

// Kalburum'un hava durumu ozelligi ("yarin yagmur var, bugun sulama atla")
// RS485 ile SET_RAIN_SKIP=1/0 gonderir. Kalici EEPROM alani degil - bilincli
// tercih: Kalburum zaten RS485 uzerinden periyodik tazeler (WiFi/internet
// durumundan bagimsiz, kablo baglantisi surdukce), ESP8266 resetlenirse
// varsayilan "sulama normal calissin" (false) guvenli taraftir. Bayrak,
// Kalburum'dan uzun sure (RAIN_SKIP_STALE_MS) haber alinamazsa da otomatik
// geçersiz sayilir - Kalburum kapali/RS485 hatti kopuk gibi durumlarda
// sulamanin sonsuza kadar yanlislikla engellenmemesi icin (fail-open).
bool yagmurSulamaAtla = false;
unsigned long yagmurSonGuncellemeMs = 0;

bool yagmurSulamaAtlaGecerli() {
  return yagmurSulamaAtla && (millis() - yagmurSonGuncellemeMs < RAIN_SKIP_STALE_MS);
}

// Kalburum'un (ESP32) MPPT'den okudugu aku voltaji kritik esigin altina
// dusunce RS485 ile MASTER:SET_BATTERY_LOW=1 gonderip sulama rolesini
// zorla kapatir - hem otomatik moda hem elle "ac" isteklerine engel olur
// (bkz applyMoistureControl ve rs485KomutDinle icindeki SET_MOISTURE=
// dalı). Voltaj toparlaninca Kalburum SET_BATTERY_LOW=0 gonderip serbest
// birakir - burada ayrica bir "geri ac" mantigi gerekmez, mevcut otomatik/
// manuel akis normal calismaya devam eder.
bool batteryLowOverride = false;

void applyMoistureControl() {
  if (batteryLowOverride) {
    if (moistureOutputActive) nanoMoistureKontrol(false);
    return;
  }
  if (!ayar.moistureAutomatic) return;
  if (sensorHatasi) return;
  if (moisturePercent <= ayar.moistureThresholdLow && !moistureOutputActive) {
    if (yagmurSulamaAtlaGecerli()) return;  // Yarin yagmur bekleniyor, yeni sulama baslatma
    nanoMoistureKontrol(true);
  } else if (moisturePercent >= ayar.moistureThresholdHigh && moistureOutputActive) {
    nanoMoistureKontrol(false);
  }
}

bool nanoRoleKontrol(bool tetikle) {
  // ACK formatı: "ACK:RELAY_ON" / "ACK:RELAY_OFF"
  String komut = tetikle ? "RELAY_ON" : "RELAY_OFF";
  String ack   = tetikle ? "ACK:RELAY_ON" : "ACK:RELAY_OFF";

  pendingCmd = {komut, ack, 0, 0};
  nanoMesgul = true;

  roleFizikselDurum = tetikle;
  buzzerHedefAktif = tetikle; // bkz nanoBuzzerKontrolPoll - harici siren yokken buzzer roleyi izler
  DEBUG_PRINTF("[NANO] Role komutu kuyruga alindi: %s\n", komut.c_str());
  return true;
}

bool nanoRolePolariteKontrol(bool aktifHigh) {
  // D4 rolesinin "aktif" seviyesini (HIGH/LOW) Nano'yu reflash etmeden
  // degistirir - Nano bunu kendi EEPROM'unda kalici saklar.
  String komut = String("SET_RELAY_POLARITY:") + (aktifHigh ? "1" : "0");
  pendingCmd = {komut, "ACK:SET_RELAY_POLARITY", 0, 0};
  nanoMesgul = true;
  DEBUG_PRINTF("[NANO] Role polarite komutu kuyruga alindi: %s\n", komut.c_str());
  return true;
}

// ============ RS485 ============
SoftwareSerial swSerial(RS485_RX_PIN, RS485_TX_PIN); // RX=D7=GPIO13, TX=D0=GPIO16
void rs485Gonder(const char* data) {
  digitalWrite(RS485_DE_PIN, HIGH);
  delayMicroseconds(100);
  swSerial.print(data);
  // FIX: swSerial.flush() ~166ms bloklar; yerine kısa delay.
  // SoftwareSerial buffer küçük olduğu için print() zaten tamamlanır.
  delay(2);
  digitalWrite(RS485_DE_PIN, LOW);
}

// FIX: masterGonder() hem periyodik (1000ms) hem de poll isteğine yanıt olarak çalışır.
// Periyodik gönderme, SoftwareSerial'in güvenilmez olduğu durumlarda yedek sağlar.
// ESP32 poll'u kaçsa bile veri akışı devam eder.
void masterGonder() {
  // Kalburum'a (ESP32) her zaman taze nem degeri gitsin diye gonderim
  // aninda oku - eskiden bu, sadece sudepo sayfasi acikken (SSE) veya
  // 60-900sn'lik periyodik olcumde tazeleniyordu, aradaki surede Kalburum
  // eski/durgun deger gorebiliyordu.
  moistureOku();
  // EKSIK KALAN YARISI (BUG): deger burada taze okunuyordu ama role KARARI
  // (applyMoistureControl) HALA sadece 60sn (gunduz) / 900sn=15dk (gece!)
  // periyodik olcum donguisunde veriliyordu - Kalburum panelinde deger
  // saniyede guncellenirken (bu fonksiyon ~1sn'de bir calisir), rolenin esigi
  // gecmesine ragmen tepki vermesi 15 dakikaya kadar gecikebiliyordu. Karar
  // da artik AYNI sikta, degerle birlikte taze veriliyor.
  if (ayar.moistureAutomatic) applyMoistureControl();
  // FIX: Mesaj ~230 byte, 160 byte buffer'a sığmıyordu - RS485 verisi kesiliyordu
  char buf[320];
  snprintf(buf, sizeof(buf),
    "ESP8266:LEVEL=%.1f,PCT=%.1f,LITRE=%.0f,TEMP=%.1f,MODE=%s,K1=%d,K2=%d,R=%d,LAMBA=%d,ALARM=%d,ERR=%d,RTC=%d,LEAK=%d,LEAK_DK=%lu,FILL=%d,MOISTURE_RAW=%d,MOISTURE_PCT=%.1f,MOISTURE_OUTPUT=%d,MOISTURE_AUTO=%d,MOISTURE_LOW=%d,MOISTURE_HIGH=%d,ALARM_MOD=%d,ALARM_MUTE=%d,ALARM_PENDING=%d,PANIC=%d,TRIG_MASK=%d,BATTERY_LOW=%d\n",
    sonSeviyeCm, sonYuzde, sonLitre, 0.0,
    geceModuMu() ? "night" : "day",
    kapi1Acik ? 1 : 0,
    kapi2Acik ? 1 : 0,
    roleFizikselDurum ? 1 : 0,
    lambaAcik ? 1 : 0,
    ayar.alarmRoleAktif ? 1 : 0,
    sensorHatasi ? 1 : 0,
    rtcHazir ? 1 : 0,
    kacakAlarmi ? 1 : 0,
    kacakSuruyor ? (millis() - kacakBaslangicMs) / 60000UL : 0,
    dolumDevamEdiyor ? 1 : 0,
    moistureRaw,
    moisturePercent,
    moistureOutputActive ? 1 : 0,
    ayar.moistureAutomatic ? 1 : 0,
    ayar.moistureThresholdLow,
    ayar.moistureThresholdHigh,
    ayar.alarmMod,
    alarmSusturuldu ? 1 : 0,
    alarmOnayBekliyor ? 1 : 0,
    panicRoleAktif ? 1 : 0,
    alarmTetikleyenMask,
    batteryLowOverride ? 1 : 0
  );
  rs485Gonder(buf);
}

// "k1=v1,k2=v2,..." formatindan tek bir anahtarin degerini cikarir (bkz
// SET_AYARLAR/GET_AYARLAR - Kalburum'un Ayarlar sekmesi icin toplu ayar
// aktarimi). Anahtar bulunamazsa bos String doner (cagiran taraf o alani
// degistirmeden birakir).
String ayarDegerAl(const String& veri, const String& anahtar) {
  String arananKey = anahtar + "=";
  int idx = veri.indexOf(arananKey);
  if (idx < 0) return "";
  int start = idx + arananKey.length();
  int end = veri.indexOf(',', start);
  if (end < 0) end = veri.length();
  return veri.substring(start, end);
}

// ============ RS485 ALICI (Master komutlarını dinle) ============
void rs485KomutDinle() {
  static String buffer;
  while (swSerial.available()) {
    char c = swSerial.read();
    if (c == '\n') {
      if (buffer.length() > 0) {
        sonRS485AlinanMsj = buffer;
        sonRS485AlinanMs = millis();
      }
      String response = "NACK:" + buffer;

      if (buffer.startsWith("MASTER:")) {
        String komut = buffer.substring(7);
        if (komut == "REQUEST_ESP8266" || komut == "REQUEST_NANO") {
          masterGonder();
          response = "ACK:" + komut;
        } else if (komut.startsWith("SET_LAMBA=")) {
          int durum = komut.substring(10).toInt();
          bool ok = nanoLambaKontrol(durum == 1);
          response = (ok ? "ACK:" : "NACK:") + komut;
        } else if (komut.startsWith("SET_ALARM=")) {
          bool ac = komut.substring(10).toInt() ? true : false;
          bool ok = nanoRoleKontrol(ac);
          if (ok) {
            ayar.alarmRoleAktif = ac ? 1 : 0;
            ayarlariKaydet();
          }
          response = (ok ? "ACK:" : "NACK:") + komut;
        } else if (komut.startsWith("SET_MOISTURE=")) {
          int durum = komut.substring(13).toInt();
          // Batarya kritikken elle "ac" istegi de reddedilir (sadece
          // otomatik moda degil) - bkz batteryLowOverride tanimi.
          bool ok = (durum == 1 && batteryLowOverride) ? false : nanoMoistureKontrol(durum == 1);
          response = (ok ? "ACK:" : "NACK:") + komut;
        } else if (komut.startsWith("SET_MOISTURE_AUTO=")) {
          bool ac = komut.substring(18).toInt() ? true : false;
          ayar.moistureAutomatic = ac ? 1 : 0;
          ayarlariKaydet();
          if (ayar.moistureAutomatic) olcumYap();
          response = "ACK:" + komut;
        } else if (komut.startsWith("SET_MOISTURE_LOW=")) {
          int value = komut.substring(17).toInt();
          if (value < 0) value = 0;
          if (value > 100) value = 100;
          ayar.moistureThresholdLow = value;
          ayarlariKaydet();
          response = "ACK:" + komut;
        } else if (komut.startsWith("SET_MOISTURE_HIGH=")) {
          int value = komut.substring(18).toInt();
          if (value < 0) value = 0;
          if (value > 100) value = 100;
          ayar.moistureThresholdHigh = value;
          ayarlariKaydet();
          response = "ACK:" + komut;
        } else if (komut.startsWith("SET_RAIN_SKIP=")) {
          yagmurSulamaAtla = komut.substring(14).toInt() ? true : false;
          yagmurSonGuncellemeMs = millis();
          response = "ACK:" + komut;
        } else if (komut.startsWith("SET_BATTERY_LOW=")) {
          batteryLowOverride = komut.substring(17).toInt() ? true : false;
          if (batteryLowOverride && moistureOutputActive) nanoMoistureKontrol(false);
          response = "ACK:" + komut;
        } else if (komut == "GET_KAYITLAR") {
          // Kayit yedekleme: ESP32'ye tum kayitlari tek satirda ('~' ile ayrilmis) gonder.
          // Yedek ESP32'nin kendi SPIFFS'inde tutulur - ESP8266'nin LittleFS'i
          // bozulur/sifirlanirsa (donanim arizasi, factory reset vb.) kurtarma icin.
          String joined = "";
          File f = LittleFS.open(KAYIT_DOSYASI, "r");
          if (f) {
            bool ilk = true;
            while (f.available()) {
              String satir = f.readStringUntil('\n'); satir.trim();
              if (satir.length() == 0) continue;
              if (!ilk) joined += "~";
              joined += satir;
              ilk = false;
            }
            f.close();
          }
          response = "ACK:GET_KAYITLAR=" + joined;
        } else if (komut == "GET_ZAMAN") {
          // ESP32'nin yedekleme zamanini gercek tarih/saat olarak damgalayabilmesi icin
          // (ESP32'de RTC yok, sadece uptime var - gercek zaman burada, DS1307'de).
          response = "ACK:GET_ZAMAN=" + simdikiZamanStr();
        } else if (komut == "RESTORE_BASLA") {
          File f = LittleFS.open("/kayit_restore_tmp.csv", "w");
          if (f) f.close();
          response = "ACK:RESTORE_BASLA";
        } else if (komut.startsWith("RESTORE_SATIR=")) {
          String satir = komut.substring(14);
          File f = LittleFS.open("/kayit_restore_tmp.csv", "a");
          if (f) { f.println(satir); f.close(); }
          response = "ACK:RESTORE_SATIR";
        } else if (komut == "RESTORE_BITIR") {
          LittleFS.remove(KAYIT_DOSYASI);
          LittleFS.rename("/kayit_restore_tmp.csv", KAYIT_DOSYASI);
          response = "ACK:RESTORE_BITIR";
        } else if (komut.startsWith("SET_KAPI=")) {
          bool kapiDurum = (komut.substring(9) == "1");
          bool ok = nanoRoleKontrol(kapiDurum);
          response = (ok ? "ACK:" : "NACK:") + komut;
        } else if (komut.startsWith("SET_ALARM_MOD=")) {
          int m = komut.substring(14).toInt();
          if (m >= 1 && m <= 3) {
            ayar.alarmMod = m; alarmOnayBekliyor = false; alarmOnaylandi = false; alarmOnaySadeceLamba = false; alarmSusturuldu = false;
            ayarlariKaydet();
            response = "ACK:" + komut;
          } else {
            response = "NACK:" + komut;
          }
        } else if (komut.startsWith("ALARM_MUTE=")) {
          // ONCEDEN "ALARM_MUTE" kosulsuz TOGGLE komutuydu - ESP32 tarafi
          // ACK kaybedip komutu tekrar gonderirse (rs485_send_wait_ack
          // retry) susturma yanlislikla iki kez tetiklenip eski haline
          // donebiliyordu. Artik ESP32 acik HEDEF degeri gonderiyor,
          // burada dogrudan o degere SET ediliyor - retry idempotent.
          alarmSusturuldu = (komut.substring(11) == "1");
          response = "ACK:" + komut;
        } else if (komut == "ALARM_ONAYLA") {
          alarmOnaylandi = true; alarmOnayBekliyor = false; alarmOnaySadeceLamba = false;
          response = "ACK:" + komut;
        } else if (komut == "ALARM_ONAYLA_LAMBA") {
          alarmOnaySadeceLamba = true; alarmOnayBekliyor = false; alarmOnaylandi = false;
          response = "ACK:" + komut;
        } else if (komut.startsWith("PANIC=")) {
          // ESP32'nin /api/panic'i bunu bekler: web /role/panic ile ayni
          // davranis, ACK icinde yeni durumu da doner (PANIC=1/0). ONCEDEN
          // bare "PANIC" kosulsuz toggle komutuydu - ayni ACK-kaybi/retry
          // riski (bkz ALARM_MUTE yorumu) panik gibi guvenlik-kritik bir
          // ozellik icin cok daha ciddiydi. Artik acik HEDEF degere set
          // ediliyor, idempotent.
          panicRoleAktif = (komut.substring(6) == "1");
          bool ok = nanoRoleKontrol(panicRoleAktif);
          response = (ok ? "ACK:" : "NACK:") + String("PANIC=") + (panicRoleAktif ? "1" : "0");
        } else if (komut == "GET_AYARLAR") {
          // Kalburum (ESP32) Ayarlar sekmesinden bu Sudepo-zonu ayarlarini
          // gorup degistirebilsin diye - ESP8266 hala tek dogru kaynak/
          // yurutucu, ESP32 sadece okuyup RS485 ile geri yaziyor.
          char buf[540];
          snprintf(buf, sizeof(buf),
            "bosMesafe=%.1f,doluMesafe=%.1f,kapasite=%.0f,alarmYuzde=%.0f,geceBaslangic=%d,geceBitis=%d,minDolumLitre=%.0f,kacakEsikDakika=%d,depoYatay=%d,moistureAutomatic=%d,moistureThresholdLow=%d,moistureThresholdHigh=%d,triggerGunduz=%d,triggerGece=%d,alarmMod=%d,alarmSensorEtkin=%d,alarmMaskSesli=%d,alarmMaskSessiz=%d,alarmMaskOnayli=%d,alarmOutputSesli=%d,alarmOutputSessiz=%d,pirPencereSaniye=%d,pirMinTetiklenme=%d,sirenGecikmeSaniye=%d,sirenChirpMs=%d,sirenBeklemeSaniye=%d,sirenAktifSaniye=%d",
            ayar.bosMesafe, ayar.doluMesafe, ayar.depoKapasiteLitre, ayar.alarmSeviyeYuzde,
            ayar.geceBaslangicSaat, ayar.geceBitisSaat, ayar.minDolumLitre, ayar.kacakEsikDakika,
            ayar.depoYatay, ayar.moistureAutomatic, ayar.moistureThresholdLow, ayar.moistureThresholdHigh,
            ayar.alarmTriggerGunduz, ayar.alarmTriggerGece, ayar.alarmMod, ayar.alarmSensorEtkin, ayar.alarmMaskSesli,
            ayar.alarmMaskSessiz, ayar.alarmMaskOnayli, ayar.alarmOutputSesli, ayar.alarmOutputSessiz,
            ayar.pirPencereSaniye, ayar.pirMinTetiklenme,
            ayar.sirenGecikmeSaniye, ayar.sirenChirpMs, ayar.sirenBeklemeSaniye, ayar.sirenAktifSaniye);
          response = "ACK:AYARLAR=" + String(buf);
        } else if (komut.startsWith("SET_AYARLAR=")) {
          String veri = komut.substring(12);
          String v;
          v = ayarDegerAl(veri, "bosMesafe"); if (v.length()) ayar.bosMesafe = v.toFloat();
          v = ayarDegerAl(veri, "doluMesafe"); if (v.length()) ayar.doluMesafe = v.toFloat();
          v = ayarDegerAl(veri, "kapasite"); if (v.length()) ayar.depoKapasiteLitre = v.toFloat();
          v = ayarDegerAl(veri, "alarmYuzde"); if (v.length()) ayar.alarmSeviyeYuzde = v.toFloat();
          v = ayarDegerAl(veri, "geceBaslangic"); if (v.length()) ayar.geceBaslangicSaat = v.toInt();
          v = ayarDegerAl(veri, "geceBitis"); if (v.length()) ayar.geceBitisSaat = v.toInt();
          v = ayarDegerAl(veri, "minDolumLitre"); if (v.length()) ayar.minDolumLitre = v.toFloat();
          v = ayarDegerAl(veri, "kacakEsikDakika"); if (v.length()) ayar.kacakEsikDakika = v.toInt();
          v = ayarDegerAl(veri, "depoYatay"); if (v.length()) ayar.depoYatay = v.toInt();
          v = ayarDegerAl(veri, "moistureAutomatic"); if (v.length()) ayar.moistureAutomatic = v.toInt() ? 1 : 0;
          v = ayarDegerAl(veri, "moistureThresholdLow"); if (v.length()) { int x = v.toInt(); if (x < 0) x = 0; if (x > 100) x = 100; ayar.moistureThresholdLow = x; }
          v = ayarDegerAl(veri, "moistureThresholdHigh"); if (v.length()) { int x = v.toInt(); if (x < 0) x = 0; if (x > 100) x = 100; ayar.moistureThresholdHigh = x; }
          v = ayarDegerAl(veri, "triggerGunduz"); if (v.length()) ayar.alarmTriggerGunduz = v.toInt();
          v = ayarDegerAl(veri, "triggerGece"); if (v.length()) ayar.alarmTriggerGece = v.toInt();
          v = ayarDegerAl(veri, "alarmMod"); if (v.length()) {
            int m = v.toInt();
            if (m >= 1 && m <= 3) { ayar.alarmMod = m; alarmOnayBekliyor = false; alarmOnaylandi = false; alarmOnaySadeceLamba = false; alarmSusturuldu = false; }
          }
          v = ayarDegerAl(veri, "alarmSensorEtkin"); if (v.length()) ayar.alarmSensorEtkin = v.toInt();
          v = ayarDegerAl(veri, "alarmMaskSesli"); if (v.length()) ayar.alarmMaskSesli = v.toInt();
          v = ayarDegerAl(veri, "alarmMaskSessiz"); if (v.length()) ayar.alarmMaskSessiz = v.toInt();
          v = ayarDegerAl(veri, "alarmMaskOnayli"); if (v.length()) ayar.alarmMaskOnayli = v.toInt();
          v = ayarDegerAl(veri, "alarmOutputSesli"); if (v.length()) ayar.alarmOutputSesli = v.toInt();
          v = ayarDegerAl(veri, "alarmOutputSessiz"); if (v.length()) ayar.alarmOutputSessiz = v.toInt();
          v = ayarDegerAl(veri, "pirPencereSaniye"); if (v.length()) { int x = v.toInt(); if (x < 0) x = 0; if (x > 120) x = 120; ayar.pirPencereSaniye = x; }
          v = ayarDegerAl(veri, "pirMinTetiklenme"); if (v.length()) { int x = v.toInt(); if (x < 1) x = 1; if (x > PIR_DARBE_GECMISI_BOYUTU) x = PIR_DARBE_GECMISI_BOYUTU; ayar.pirMinTetiklenme = x; }
          v = ayarDegerAl(veri, "sirenGecikmeSaniye"); if (v.length()) { int x = v.toInt(); if (x < 0) x = 0; if (x > 120) x = 120; ayar.sirenGecikmeSaniye = x; }
          v = ayarDegerAl(veri, "sirenChirpMs"); if (v.length()) { int x = v.toInt(); if (x < 50) x = 50; if (x > 5000) x = 5000; ayar.sirenChirpMs = x; }
          v = ayarDegerAl(veri, "sirenBeklemeSaniye"); if (v.length()) { int x = v.toInt(); if (x < 1) x = 1; if (x > 120) x = 120; ayar.sirenBeklemeSaniye = x; }
          v = ayarDegerAl(veri, "sirenAktifSaniye"); if (v.length()) { int x = v.toInt(); if (x < 1) x = 1; if (x > 120) x = 120; ayar.sirenAktifSaniye = x; }
          ayarlariKaydet();
          response = "ACK:SET_AYARLAR";
        }
      } else {
        String komut = buffer;
        if (komut == "GET_STATUS") {
          masterGonder();
          response = "ACK:" + komut;
        } else if (komut == "LAMBA_ON") {
          nanoLambaKontrol(true);
          response = "ACK:" + komut;
        } else if (komut == "LAMBA_OFF") {
          nanoLambaKontrol(false);
          response = "ACK:" + komut;
        } else if (komut == "RELAY_ON") {
          nanoRoleKontrol(true);
          response = "ACK:" + komut;
        } else if (komut == "RELAY_OFF") {
          nanoRoleKontrol(false);
          response = "ACK:" + komut;
        }
      }

