Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
void handleKayitListesi() {
  KayitOzeti o; kayitOzet(o);
  String j = "{\"kayitlar\":" + kayitlariOkuJSON(100) + ",\"ozet\":{\"toplamLitre\":" + String(o.toplamLitre,1) + ",\"toplamUcret\":" + String(o.toplamUcret,2) + ",\"ayLitre\":" + String(o.ayLitre,1) + ",\"ayUcret\":" + String(o.ayUcret,2) + ",\"ayYagmur\":" + String(o.ayYagmur,1) + ",\"aySebeke\":" + String(o.aySebeke,1) + ",\"ayTanker\":" + String(o.ayTanker,1) + ",\"kayitSayisi\":" + String(o.kayitSayisi) + ",\"belirsizSayisi\":" + String(o.belirsizSayisi) + "}}";
  server.send(200, "application/json", j);
}
void handleKayitEkle() {
  if (!server.hasArg("litre") || !server.hasArg("tarih")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"Eksik\"}"); return; }
  String t = server.arg("tarih"), k = server.hasArg("kisi")?server.arg("kisi"):"-", y = server.hasArg("kaynak")?server.arg("kaynak"):"Sebeke";
  float l = server.arg("litre").toFloat(), u = server.hasArg("ucret")?server.arg("ucret").toFloat():0;
  if (l <= 0) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"Litre hata\"}"); return; }
  server.send(200, "application/json", kayitEkle(t,k,l,u,y) ? "{\"basarili\":true,\"mesaj\":\"OK\"}" : "{\"basarili\":false,\"mesaj\":\"Hata\"}");
}
void handleKayitGuncelle() {
  if (!server.hasArg("index")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"index eksik\"}"); return; }
  int idx = server.arg("index").toInt();
  String t = server.hasArg("tarih")?server.arg("tarih"):simdikiTarihISO(), k = server.hasArg("kisi")?server.arg("kisi"):"-", y = server.hasArg("kaynak")?server.arg("kaynak"):"Belirsiz";
  float l = server.hasArg("litre")?server.arg("litre").toFloat():0, u = server.hasArg("ucret")?server.arg("ucret").toFloat():0;
  server.send(200, "application/json", kayitGuncelle(idx,t,k,l,u,y) ? "{\"basarili\":true,\"mesaj\":\"OK\"}" : "{\"basarili\":false,\"mesaj\":\"Bulunamadi\"}");
}
void handleKayitSil() {
  if (!server.hasArg("index")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"index eksik\"}"); return; }
  server.send(200, "application/json", kayitSil(server.arg("index").toInt()) ? "{\"basarili\":true,\"mesaj\":\"OK\"}" : "{\"basarili\":false,\"mesaj\":\"Bulunamadi\"}");
}
void handleKayitCSV() {
  File f = LittleFS.open(KAYIT_DOSYASI, "r");
  if (!f) { server.send(404, "text/plain", "Yok"); return; }
  server.sendHeader("Content-Disposition", "attachment; filename=kayitlar.csv");
  server.streamFile(f, "text/csv"); f.close();
}
void handleKayitTemizle() {
  if (server.arg("onay") != "evet") { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"Onay\"}"); return; }
  LittleFS.remove(KAYIT_DOSYASI); File f = LittleFS.open(KAYIT_DOSYASI, "w"); if (f) f.close();
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Tumunu silindi\"}");
}
void handleRoleAyarla() {
  if (!server.hasArg("aktif")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"param eksik\"}"); return; }
  ayar.alarmRoleAktif = server.arg("aktif").toInt()?1:0; ayarlariKaydet();
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"" + String(ayar.alarmRoleAktif?"Aktif":"Pasif") + "\"}");
}
void handleRolePanic() {
  panicRoleAktif = !panicRoleAktif;  // Toggle - panik butonu her basış toggle yapar
  bool ok = nanoRoleKontrol(panicRoleAktif);
  server.send(200, "application/json", "{\"basarili\":" + String(ok?"true":"false") + ",\"mesaj\":\"" + String(panicRoleAktif?"Panik Acik":"Panik Kapali") + "\",\"panic\":" + String(panicRoleAktif?"true":"false") + "}");
}
void handleRolePolarite() {
  if (!server.hasArg("aktif")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"param eksik\"}"); return; }
  bool aktifHigh = server.arg("aktif").toInt() != 0;
  nanoRolePolariteKontrol(aktifHigh);
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Polarite: " + String(aktifHigh ? "HIGH=Aktif" : "LOW=Aktif") + "\"}");
}
void handleAlarmSustur() {
  // Susturma = "sireni kapat": tetikleyici hala aktif olsa da rölenin
  // sese/tetiklenmeye devam etmesini durdurur. Yeni bir tetikleyici
  // (durum degisikligi) gelene kadar susturulmus kalir.
  alarmSusturuldu = !alarmSusturuldu;
  server.send(200, "application/json", "{\"basarili\":true,\"susturuldu\":" + String(alarmSusturuldu ? "true" : "false") + "}");
}
void handleAlarmOnayla() {
  // Mod 3 (Onayli): kullanici tetiklenmeyi onaylar, siren sesli mod gibi calismaya baslar.
  alarmOnaylandi = true; alarmOnayBekliyor = false; alarmOnaySadeceLamba = false;
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Onaylandi\"}");
}
void handleAlarmOnaylaLamba() {
  // Mod 3 (Onayli): kullanici sadece lamba flasoru ister - siren/role calismaz.
  alarmOnaySadeceLamba = true; alarmOnayBekliyor = false; alarmOnaylandi = false;
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Sadece lamba flasoru aktif\"}");
}
String jsonKacir(const String& s) {
  String out = s;
  out.replace("\\", "\\\\");
  out.replace("\"", "\\\"");
  return out;
}
void handleAlarmLog() {
  String j = "[";
  for (uint8_t i = 0; i < alarmLogRAMDolu; i++) {
    if (i) j += ",";
    j += "{\"zaman\":\"" + jsonKacir(alarmLogRAM[i].zaman) + "\",\"baslik\":\"" + jsonKacir(alarmLogRAM[i].baslik) + "\",\"tetikleyen\":\"" + jsonKacir(alarmLogRAM[i].tetikleyen) + "\"}";
  }
  j += "]";
  server.send(200, "application/json", j);
}
// ESP32 Merkez Kontrol panelindeki handleAPI_AlarmLogTam ile AYNI mantik -
// "tetikleyen" alani virgul icerebildigi icin sadece ILK IKI virgule kadar bolunur.
void handleAlarmLogTam() {
  String j = "[";
  bool ilk = true;
  if (LittleFS.exists(ALARM_LOG_DOSYASI)) {
    File f = LittleFS.open(ALARM_LOG_DOSYASI, "r");
    if (f) {
      while (f.available()) {
        String satir = f.readStringUntil('\n');
        satir.trim();
        if (satir.length() == 0) continue;
        int v1 = satir.indexOf(',');
        int v2 = (v1 >= 0) ? satir.indexOf(',', v1 + 1) : -1;
        if (v1 < 0 || v2 < 0) continue;
        if (!ilk) j += ",";
        ilk = false;
        j += "{\"zaman\":\"" + jsonKacir(satir.substring(0, v1)) + "\",\"baslik\":\"" + jsonKacir(satir.substring(v1 + 1, v2)) + "\",\"tetikleyen\":\"" + jsonKacir(satir.substring(v2 + 1)) + "\"}";
      }
      f.close();
    }
  }
  j += "]";
  server.send(200, "application/json", j);
}
void handleWifiDurum() {
  bool b = (WiFi.status() == WL_CONNECTED);
  server.send(200, "application/json", "{\"tanimli\":" + String(strlen(wifiAyar.ssid)>0?"true":"false") + ",\"ssid\":\"" + String(wifiAyar.ssid) + "\",\"bagli\":" + String(b?"true":"false") + ",\"ip\":\"" + (b?WiFi.localIP().toString():"-") + "\",\"sifreVar\":" + String(strlen(wifiAyar.sifre)>0?"true":"false") + "}");
}
void handleWifiKaydet() {
  String ssid = "";
  String pw = "";
  // Accept either long names (ssid/sifre) or short names (s/p) from the JS/UI
  if (server.hasArg("ssid")) ssid = server.arg("ssid");
  else if (server.hasArg("s")) ssid = server.arg("s");
  if (server.hasArg("sifre")) pw = server.arg("sifre");
  else if (server.hasArg("p")) pw = server.arg("p");

  // If no SSID provided at all, reject the request
  if (!server.hasArg("ssid") && !server.hasArg("s")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"ssid eksik\"}"); return; }

  // Empty SSID => remove saved WiFi
  if (ssid.length() == 0) {
    wifiAyar.ssid[0]='\0'; wifiAyar.sifre[0]='\0'; wifiAyarlariKaydet(); WiFi.disconnect();
    server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Kaldirildi\"}");
    return;
  }

  ssid.toCharArray(wifiAyar.ssid, 32);
  // FIX: Sifre bos birakildiysa eski kayitli sifre korunur (silinmez).
  // Ayrica bozuk DEBUG_PRINTF satiri duzeltildi.
  if (pw.length() > 0) {
    pw.toCharArray(wifiAyar.sifre, 32);
  }
  wifiAyarlariKaydet();
  DEBUG_PRINTF("[WIFI] Kaydedilen SSID: %s, sifreVar=%d\n", wifiAyar.ssid, strlen(wifiAyar.sifre) > 0);
  WiFi.disconnect(); delay(100);
  WiFi.begin(wifiAyar.ssid, wifiAyar.sifre);
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Kaydedildi\"}");
}

void handleWifiScan() {
  delay(100); // give radio a moment
  DEBUG_PRINTLN("[WIFI] Scan basliyor...");
  int n = WiFi.scanNetworks();
  DEBUG_PRINTF("[WIFI] Bulunan ag sayisi: %d\n", n);
  String j = "[";
  for (int i = 0; i < n; i++) {
    if (i) j += ",";
    String ss = WiFi.SSID(i);
    int r = WiFi.RSSI(i);
    bool sec = (WiFi.encryptionType(i) != ENC_TYPE_NONE);
    DEBUG_PRINTF("[WIFI] %d: %s (%d dBm) secured=%d\n", i, ss.c_str(), r, sec);
    // FIX: Tirnak/backslash iceren SSID'ler JSON'u bozuyordu
    ss.replace("\\", "\\\\");
    ss.replace("\"", "\\\"");
    j += "{\"ssid\":\"" + ss + "\",\"rssi\":" + String(r) + ",\"secured\":" + String(sec ? "true" : "false") + "}";
  }
  j += "]";
  server.send(200, "application/json", j);
}

// https://host[:port]/path formatindan host/port ayiklar (probeMaxFragmentLength icin).
static bool parseHttpsHost(const String& url, String& host, uint16_t& port) {
  if (!url.startsWith("https://")) return false;
  int hostStart = 8; // strlen("https://")
  int pathStart = url.indexOf('/', hostStart);
  String hostPort = (pathStart == -1) ? url.substring(hostStart) : url.substring(hostStart, pathStart);
  int colon = hostPort.indexOf(':');
  if (colon == -1) { host = hostPort; port = 443; }
  else { host = hostPort.substring(0, colon); port = (uint16_t)hostPort.substring(colon + 1).toInt(); }
  return host.length() > 0;
}

// ============ JS ENDPOINT ============
// FIX: Eskiden yanit indirme/yazma BASLAMADAN ONCE "Guncelleniyor" diye
// gonderiliyordu - basarili da olsa (kutuphane ESP.restart() ile yanit asla
// gonderilemeden yeniden baslatiyordu) basarisiz da olsa (hata sadece
// Serial'e yaziliyordu) buton metni sonsuza kadar "Guncelleniyor" yazili
// kaliyordu. Simdi rebootOnUpdate(false) ile otomatik restart kapatilip
// yanit GERCEK sonucla gonderiliyor, restart ondan SONRA yapiliyor.
void performOTA(const String& url) {
  ESPhttpUpdate.rebootOnUpdate(false);
  t_httpUpdate_return ret;
  if (url.startsWith("https://")) {
    // https:// (orn. raw.githubusercontent.com) icin BearSSL gerekir - sertifika
    // zincirini dogrulamadan kabul eder (ESP8266'da tam zincir dogrulama pahali).
    BearSSL::WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(15000);
    // FIX: BearSSL'in varsayilan TLS tampon boyutlari (~16KB+) ESP8266'nin
    // ~80KB RAM'inde (WebServer/LittleFS/RS485/EEPROM zaten kullanimda)
    // ayrilamiyordu - ("connection failed"). Once sabit 512 bayta
    // zorlandi, ama bu da YANLIS: sunucu o boyutu gercekte kabul etmeyip
    // daha buyuk bir kayit gonderdiginde BearSSL'in tampona sigdiramayip
    // baglantiyi ortadan kesmesine yol acti ("connection lost"). Dogrusu:
    // once probeMaxFragmentLength ile sunucunun GERCEKTEN destekledigi en
    // kucuk boyutu sormak, sadece o boyutu kullanmak - sunucu desteklemezse
    // varsayilan (buyuk) tampona geri donulur.
    String host; uint16_t port;
    if (parseHttpsHost(url, host, port)) {
      int mfln = client.probeMaxFragmentLength(host.c_str(), port, 512);
      if (mfln > 0) client.setBufferSizes(mfln, mfln);
    }
    ret = ESPhttpUpdate.update(client, url);
  } else {
    WiFiClient client;
    ret = ESPhttpUpdate.update(client, url);
  }

  String mesaj;
  bool basarili = (ret == HTTP_UPDATE_OK);
  if (basarili) {
    mesaj = "Basarili - yeniden baslatiliyor";
  } else if (ret == HTTP_UPDATE_NO_UPDATES) {
    mesaj = "Guncelleme yok";
  } else {
    // Teshis icin: "connection failed" hem dusuk heap (BearSSL) hem de STA'nin
    // gercekte internete cikamamasi (sadece yerel ag/AP) yuzunden olabilir -
    // ikisini ayirt etmek icin heap + WiFi durumu hataya ekleniyor.
    mesaj = "Hata: " + ESPhttpUpdate.getLastErrorString() +
            " [heap:" + String(ESP.getFreeHeap()) +
            " wifi:" + (WiFi.isConnected() ? (WiFi.SSID() + "/" + WiFi.localIP().toString()) : "baglanti-yok") + "]";
  }
  // FIX: /ota?url=X her tiklamada AYNI URL ile GET istegi - tarayici
  // Cache-Control gonderilmezse bunu onbellekleyip cihaza hic gitmeden eski
  // yaniti (orn. eski firmware'den kalma "Guncelleniyor: X" metnini) tekrar
  // tekrar gosterebiliyordu.
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.send(200, "application/json", "{\"basarili\":" + String(basarili ? "true" : "false") + ",\"mesaj\":\"" + mesaj + "\"}");
  if (basarili) { delay(200); ESP.restart(); }
}

void handleOTAUpdate() {
  if (!server.hasArg("url")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"URL eksik\"}"); return; }
  performOTA(server.arg("url"));
}

