Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
// Kalburum'daki "GitHub'dan Guncelle" tek-tikla butonunun aynisi - internet
// varsa (orn. telefon hotspot'u) dogrudan GitHub'dan ceker, Kalburum'un
// yerel deposuna ihtiyac duymaz.
void handleOTAGithub() {
  performOTA(GITHUB_FIRMWARE_URL);
}

// ============ DOSYADAN OTA (bin dosyasi web'den yuklenir) ============
void handleFileUploadUpdate() {
  server.sendHeader("Connection", "close");
  server.send(200, "text/plain", Update.hasError() ? "FAIL" : "OK");
  delay(100);
  ESP.restart();
}

void handleFileUploadProgress() {
  HTTPUpload& upload = server.upload();
  if (upload.status == UPLOAD_FILE_START) {
    DEBUG_PRINTF("[OTA-FILE] Basliyor: %s\n", upload.filename.c_str());
    uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
    if (!Update.begin(maxSketchSpace)) { Update.printError(Serial); }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) { Update.printError(Serial); }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (Update.end(true)) {
      DEBUG_PRINTF("[OTA-FILE] Basarili: %u byte\n", upload.totalSize);
    } else {
      Update.printError(Serial);
    }
  }
}

// /app.js firmware'e gomulu (bkz web_content.h)
void handleJS() {
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "0");
  server.send_P(200, "application/javascript", APP_JS);
}

// /config.js dinamik - sadece const K=... degerini icerir
void handleConfigJS() {
  server.send(200, "application/javascript",
    "const K=" + String(ayar.depoKapasiteLitre, 0) + ";");
}

// ============ WiFi KURULUMU ============
void setupWiFi() {
  WiFi.softAPdisconnect(true); WiFi.mode(WIFI_OFF); delay(200);
  WiFi.mode(WIFI_AP_STA); WiFi.setSleepMode(WIFI_NONE_SLEEP); delay(100);
  bool ok = WiFi.softAP(WIFI_AP_SSID, WIFI_AP_PASSWORD, WIFI_AP_CHANNEL, WIFI_AP_HIDDEN);
  if (ok) { DEBUG_PRINT("AP: "); DEBUG_PRINTLN(WIFI_AP_SSID); DEBUG_PRINT("IP: "); DEBUG_PRINTLN(WiFi.softAPIP()); }
  if (strlen(wifiAyar.ssid) > 0) {
    String host = mdnsHostname();
    WiFi.hostname(host.c_str());
    DEBUG_PRINT("STA: "); DEBUG_PRINTLN(wifiAyar.ssid);
    WiFi.begin(wifiAyar.ssid, wifiAyar.sifre);
  }
}

// Genel amacli /pin/mode,/pin/write,/pin/read GPIO API'si (Nano'ya dogrudan
// serial komut gonderir) icin donanima ONCEDEN AYRILMIS pinleri korur.
// ONCEDEN BUG: bu API hicbir blacklist olmadan pin numarasini oldugu gibi
// Nano'ya iletiyordu - orn. /pin/write?pin=4&val=1 dogrudan alarm rolesini
// (nano_io/include/config.h: RELAY_PIN=4) manipule edebiliyordu,
// /pin/mode?pin=6&mod=OUTPUT ise PIR pinini (PIR_PIN=6) surucu cikisina
// cevirip surekli yanlis "hareket" bildirimine yol acabiliyordu -
// hicbir kimlik dogrulama da yok. Pin numaralari nano_io/include/config.h
// ile SENKRON tutulmali: DOOR1_PIN=2, DOOR2_PIN=3, RELAY_PIN=4,
// MOISTURE_PIN=5, PIR_PIN=6, LAMBA_PIN=13.
bool pinKorumali(int pin) {
  return pin == 2 || pin == 3 || pin == 4 || pin == 5 || pin == 6 || pin == 13 || pin == NANO_BUZZER_PIN;
}

// ============ SETUP ============
void setup() {
  // FIX: Serial (UART0) 9600 baud'da başlatılır - Nano ile aynı hız
  // NOT: ESP8266 UART0 (TX=GPIO1, RX=GPIO3) HEM debug hem Nano için kullanılır.
  // Debug mesajları Nano tarafından "UNKNOWN_COMMAND" olarak yanıtlanır, işlevsel etkisi yoktur.
  Serial.begin(NANO_BAUDRATE); delay(500);
  DEBUG_PRINTLN("");
  DEBUG_PRINTLN("[SISTEM] Basliyor...");
  DEBUG_PRINTF("[SISTEM] Nano baglanti: %d baud\n", NANO_BAUDRATE);
  DEBUG_PRINTF("📶 STA IP: %s\n", WiFi.localIP().toString().c_str());
  
  ayarlariYukle();
  wifiAyarlariYukle();
  pinMode(TRIG_PIN, OUTPUT); pinMode(ECHO_PIN, INPUT); digitalWrite(TRIG_PIN, LOW);
  pinMode(RS485_DE_PIN, OUTPUT); digitalWrite(RS485_DE_PIN, LOW);
  // NOT: LAMBA_PIN Nano üzerinde (D13), ESP8266'da değil
  swSerial.begin(RS485_BAUDRATE);
  // FIX: LittleFS.begin() hatasi + format sonrasi ikinci begin kontrol edilmiyordu.
  // FS acilamazsa dosya okuma/yazma islemleri sessizce basarisiz oluyordu.
  if (!LittleFS.begin()) {
    DEBUG_PRINTLN("[LittleFS] begin basarisiz, formatliyorum...");
    LittleFS.format();
    if (!LittleFS.begin()) {
      DEBUG_PRINTLN("[LittleFS] HATA: format sonrasi begin de basarisiz!");
    } else {
      DEBUG_PRINTLN("[LittleFS] format ve begin tamam");
    }
  }
  if (!LittleFS.exists(KAYIT_DOSYASI)) { File f = LittleFS.open(KAYIT_DOSYASI, "w"); if (f) f.close(); }
  if (!LittleFS.exists(TUKETIM_DOSYASI)) { File f = LittleFS.open(TUKETIM_DOSYASI, "w"); if (f) f.close(); }
  if (!LittleFS.exists(TUKETIM_GECMIS_DOSYASI)) { File f = LittleFS.open(TUKETIM_GECMIS_DOSYASI, "w"); if (f) f.close(); }
  Wire.begin(RTC_SDA, RTC_SCL);
  delay(100);
  if (!rtc.begin()) {
    rtcHazir = false;
    DEBUG_PRINTLN("[RTC] DS1307 bulunamadi - pil bitmis olabilir!");
  } else {
    rtcHazir = true;
    // TANI LOGU: "RTC yine kayboldu" sikayeti tekrarlarsa, gercekten pil/
    // osilator mu durmus (donanim) yoksa isrunning() tek seferlik I2C
    // gurultusuyle mi yanlis "durmus" okumus (yazilim) ayirt edebilmek icin -
    // adjust() ile UZERINE YAZMADAN ONCE cipte fiilen ne kayitli oldugunu
    // logla. Eger burada makul/yakin bir tarih goruluyorsa (ornegin bugune
    // yakin), pil/osilator sorunu degil, tek seferlik yanlis okuma demektir.
    DateTime oncekiDeger = rtc.now();
    char tanibuf[32];
    snprintf(tanibuf, sizeof(tanibuf), "%02d/%02d/%04d %02d:%02d:%02d", oncekiDeger.day(), oncekiDeger.month(), oncekiDeger.year(), oncekiDeger.hour(), oncekiDeger.minute(), oncekiDeger.second());
    DEBUG_PRINT("[RTC] Boot - isrunning="); DEBUG_PRINT(rtc.isrunning() ? "evet" : "HAYIR");
    DEBUG_PRINT(", cipteki mevcut deger="); DEBUG_PRINTLN(tanibuf);
    if (!rtc.isrunning()) {
      DEBUG_PRINTLN("[RTC] DS1307 calismiyor - build tarihine resetleniyor (yukaridaki 'cipteki mevcut deger' kaybolan zamandi)");
      rtc.adjust(DateTime(F(__DATE__), F(__TIME__)));
    }
  }
  // FIX: HC-SR04 boot aninda (guc rayi henuz tam oturmamisken, WiFi radyosu
  // daha baslamadan) ilk olcumde bazen gecerli yaniti vermiyor, "sensor
  // hatasi" alarmini gereksiz yere tetikliyordu ("her ac/kapatta" sikayeti).
  // Ilk olcum basarisiz olursa donanim gercekten arizali degilse birkac
  // deneme icinde duzelir - kisa aralarla birkac kez daha denenir.
  olcumYap();
  for (int deneme = 0; deneme < 3 && sensorHatasi; deneme++) {
    delay(200);
    olcumYap();
  }
  setupWiFi();

  // FIX: STA baglantisini bekle - mDNS icin gecerli IP gerekli.
  // WiFi.begin() asenkron calisir; IP almadan MDNS.begin() yapilirsa
  // sudepo.local cozulemez.
  if (strlen(wifiAyar.ssid) > 0) {
    unsigned long baslaMs = millis();
    while (WiFi.status() != WL_CONNECTED && millis() - baslaMs < 8000) {
      delay(100);
      yield();  // watchdog reset
    }
  }

  // FIX: mDNS'i WiFi baglantisi SONRASINDA baslat (gecerli IP ile).
  // Hostname = WIFI_AP_SSID (kucuk harf). Orn: "SuDepo" -> sudepo.local
  String host = mdnsHostname();
  if (MDNS.begin(host.c_str())) {
    MDNS.addService("http", "tcp", 80);
    mdnsAktif = true;
    DEBUG_PRINTF("[mDNS] Baslatildi: %s.local\n", host.c_str());
  } else {
    mdnsAktif = false;
    DEBUG_PRINTLN("[mDNS] Baslatma basarisiz!");
  }
  ArduinoOTA.setHostname(host.c_str()); ArduinoOTA.setPassword(OTA_PASSWORD); ArduinoOTA.begin();

  server.on("/", handleRoot); server.on("/style.css", handleCSS);
  server.on("/app.js", handleJS); server.on("/config.js", handleConfigJS);
  server.on("/events", handleSSE);
  server.on("/olc", handleMeasure); server.on("/durum", handleStatus); server.on("/zaman", handleTime); server.on("/ayarla", handleSetTime);
  server.on("/ayarlar", HTTP_GET, handleGetSettings); server.on("/ayarlar/kaydet", handleSaveSettings);
  server.on("/kayit/liste", handleKayitListesi); server.on("/kayit/ekle", handleKayitEkle); server.on("/kayit/guncelle", handleKayitGuncelle); server.on("/kayit/sil", handleKayitSil); server.on("/kayit/csv", handleKayitCSV); server.on("/kc", handleKayitCSV); server.on("/kayit/temizle", handleKayitTemizle);
  server.on("/role/ayarla", handleRoleAyarla); server.on("/role/panic", handleRolePanic);
  server.on("/alarm/sustur", handleAlarmSustur); server.on("/alarm/onayla", handleAlarmOnayla); server.on("/alarm/onayla_lamba", handleAlarmOnaylaLamba);
  server.on("/alarm/log", handleAlarmLog);
  server.on("/alarm/log/tam", handleAlarmLogTam);
  server.on("/role/polarite", handleRolePolarite);
  server.on("/wifi/durum", handleWifiDurum); server.on("/wifi/kaydet", handleWifiKaydet);
  server.on("/wifi/scan", handleWifiScan);
  server.on("/lamba", []() { if (!server.hasArg("durum")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"param eksik\"}"); return; } int y = server.arg("durum").toInt(); // Buffer temizle, komutu gönder, ACK bekle (max 300ms)
  while (Serial.available()) Serial.read();
  Serial.println(y ? "LAMBA_ON" : "LAMBA_OFF");
  unsigned long t = millis(); bool ok = false;
  while (millis() - t < 300) {
    if (Serial.available()) {
      String r = Serial.readStringUntil('\n'); r.trim();
      if (r.indexOf("ACK:LAMBA") >= 0) { ok = true; break; }
    }
    yield();
  }
  if (ok) lambaAcik = (y == 1); server.send(200, "application/json", "{\"basarili\":" + String(ok?"true":"false") + ",\"mesaj\":\"" + String(ok?(lambaAcik?"Acik":"Kapali"):"Hatali") + "\"}");});  
  server.on("/nem", []() { if (!server.hasArg("durum")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"param eksik\"}"); return; } int y = server.arg("durum").toInt(); while (Serial.available()) Serial.read(); Serial.println(y ? "MOISTURE_ON" : "MOISTURE_OFF"); unsigned long t = millis(); bool ok = false; while (millis() - t < 300) { if (Serial.available()) { String r = Serial.readStringUntil('\n'); r.trim(); if (r.indexOf("ACK:MOISTURE") >= 0) { ok = true; break; } } yield(); }
  if (ok) moistureOutputActive = (y == 1); server.send(200, "application/json", "{\"basarili\":" + String(ok?"true":"false") + ",\"mesaj\":\"" + String(ok?(moistureOutputActive?"Acik":"Kapali"):"Hatali") + "\"}");});
  server.on("/nem/mod", []() { if (!server.hasArg("otomatik")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"param eksik\"}"); return; } ayar.moistureAutomatic = server.arg("otomatik").toInt()?1:0; ayarlariKaydet(); if (ayar.moistureAutomatic) { olcumYap(); } server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"" + String(ayar.moistureAutomatic?"Otomatik":"Manuel") + "\"}"); });
  // ===== NANO GENEL GPIO API (PIN_MODE/PIN_WRITE/PIN_READ) =====
  // Nano'ya seri komut gonderir, yaniti bekler ve JSON olarak dondurur.
  // Ornek: /pin/mode?pin=6&mod=OUTPUT  |  /pin/write?pin=6&val=1  |  /pin/read?pin=6
  server.on("/pin/mode", []() {
    if (!server.hasArg("pin") || !server.hasArg("mod")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"pin ve mod gerekli\"}"); return; }
    int pin = server.arg("pin").toInt();
    if (pinKorumali(pin)) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"Bu pin donanima ayrilmis (kapi/role/PIR/lamba), genel GPIO API ile degistirilemez\"}"); return; }
    String mod = server.arg("mod"); mod.toUpperCase();
    if (mod != "OUTPUT" && mod != "INPUT" && mod != "INPUT_PULLUP") { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"mod: OUTPUT/INPUT/INPUT_PULLUP\"}"); return; }
    while (Serial.available()) Serial.read();
    Serial.print("PIN_MODE:"); Serial.print(pin); Serial.print(","); Serial.println(mod);
    unsigned long t = millis(); String r = ""; bool ok = false;
    while (millis() - t < 300) {
      if (Serial.available()) { r = Serial.readStringUntil('\n'); r.trim(); if (r.indexOf("ACK:PIN_MODE") >= 0) { ok = true; break; } }
      yield();
    }
    server.send(200, "application/json", "{\"basarili\":" + String(ok?"true":"false") + ",\"mesaj\":\"" + String(ok?("Pin "+String(pin)+" -> "+mod):"Nano yanit vermedi") + "\",\"reply\":\"" + r + "\"}");
  });
  server.on("/pin/write", []() {
    if (!server.hasArg("pin") || !server.hasArg("val")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"pin ve val gerekli\"}"); return; }
    int pin = server.arg("pin").toInt();
    if (pinKorumali(pin)) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"Bu pin donanima ayrilmis (kapi/role/PIR/lamba), genel GPIO API ile degistirilemez\"}"); return; }
    int val = server.arg("val").toInt();
    while (Serial.available()) Serial.read();
    Serial.print("PIN_WRITE:"); Serial.print(pin); Serial.print(","); Serial.println(val);
    unsigned long t = millis(); String r = ""; bool ok = false;
    while (millis() - t < 300) {
      if (Serial.available()) { r = Serial.readStringUntil('\n'); r.trim(); if (r.indexOf("ACK:PIN_WRITE") >= 0) { ok = true; break; } }
      yield();
    }
    server.send(200, "application/json", "{\"basarili\":" + String(ok?"true":"false") + ",\"mesaj\":\"" + String(ok?("Pin "+String(pin)+" = "+String(val)):"Nano yanit vermedi") + "\",\"reply\":\"" + r + "\"}");
  });
  server.on("/pin/read", []() {
    if (!server.hasArg("pin")) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"pin gerekli\"}"); return; }
    int pin = server.arg("pin").toInt();
    if (pinKorumali(pin)) { server.send(400, "application/json", "{\"basarili\":false,\"mesaj\":\"Bu pin donanima ayrilmis (kapi/role/PIR/lamba), genel GPIO API ile okunamaz\"}"); return; }
    while (Serial.available()) Serial.read();
    Serial.print("PIN_READ:"); Serial.println(pin);
    unsigned long t = millis(); String r = ""; bool ok = false;
    while (millis() - t < 300) {
      if (Serial.available()) { r = Serial.readStringUntil('\n'); r.trim(); if (r.indexOf("PIN:") >= 0) { ok = true; break; } }
      yield();
    }
    int deger = -1;
    if (ok) { int eq = r.indexOf('='); if (eq >= 0) deger = r.substring(eq+1).toInt(); }
    server.send(200, "application/json", "{\"basarili\":" + String(ok?"true":"false") + ",\"pin\":" + String(pin) + ",\"deger\":" + String(deger) + ",\"reply\":\"" + r + "\"}");
  });
  // Buzzer'i (D12/NANO_BUZZER_PIN) elle test etmek icin - PIR'i tetiklemeden
  // "ses geliyor mu" diye aninda kontrol edebilmek icin (2026-08-27, kullanici
  // "ses gelmiyor" bulgusu sonrasi eklendi). Ornek: /buzzer/test?freq=3000&ms=500
  server.on("/buzzer/test", []() {
    int freq = server.hasArg("freq") ? server.arg("freq").toInt() : BUZZER_CHIRP_FREKANS_HZ;
    int sure = server.hasArg("ms") ? server.arg("ms").toInt() : BUZZER_CHIRP_SURE_MS;
    while (Serial.available()) Serial.read();
    Serial.print("TONE_PLAY:"); Serial.print(NANO_BUZZER_PIN); Serial.print(","); Serial.print(freq); Serial.print(","); Serial.println(sure);
    unsigned long t = millis(); String r = ""; bool ok = false;
    while (millis() - t < 300) {
      if (Serial.available()) { r = Serial.readStringUntil('\n'); r.trim(); if (r.indexOf("ACK:TONE_PLAY") >= 0) { ok = true; break; } if (r.indexOf("NACK") >= 0) break; }
      yield();
    }
    server.send(200, "application/json", "{\"basarili\":" + String(ok ? "true" : "false") + ",\"freq\":" + String(freq) + ",\"ms\":" + String(sure) + ",\"reply\":\"" + r + "\"}");
  });
  server.on("/pin/readall", []() {
    while (Serial.available()) Serial.read();
    Serial.println("PIN_READ_ALL");
    unsigned long t = millis(); String r = ""; bool ok = false;
    while (millis() - t < 500) {
      if (Serial.available()) { r = Serial.readStringUntil('\n'); r.trim(); if (r.indexOf("PIN:") >= 0) { ok = true; break; } }
      yield();
    }
    server.send(200, "application/json", "{\"basarili\":" + String(ok?"true":"false") + ",\"durum\":\"" + r + "\"}");
  });
  server.on("/rs485/debug", []() { String j = "{\"sonMsj\":\"" + sonRS485AlinanMsj + "\",\"yas_ms\":" + String(millis() - sonRS485AlinanMs) + ",\"lamba\":" + String(lambaAcik ? "true" : "false") + ",\"nanoBagli\":" + String(nanoBaglantiVar ? "true" : "false") + "}"; server.send(200, "application/json", j); });
  server.on("/ota", handleOTAUpdate);
  server.on("/ota/github", handleOTAGithub);
  server.on("/restart", handleRestart);
  server.on("/update", HTTP_POST, handleFileUploadUpdate, handleFileUploadProgress);
  server.begin();
  sonOtomatikOlcumMs = millis();
  
  // ===== BILGILER =====
  DEBUG_PRINTLN("\n========================================");
  DEBUG_PRINTLN("✅ SISTEM BILGILERI");
  DEBUG_PRINTLN("========================================");
  DEBUG_PRINTF("📡 AP SSID: %s\n", WIFI_AP_SSID);
  DEBUG_PRINTF("📡 AP Sifre: %s\n", WIFI_AP_PASSWORD);
  DEBUG_PRINTF("📡 AP IP: %s\n", WiFi.softAPIP().toString().c_str());
  if (strlen(wifiAyar.ssid) > 0) {
    DEBUG_PRINTF("📶 STA SSID: %s\n", wifiAyar.ssid);
    DEBUG_PRINTF("📶 STA Sifre: %s\n", wifiAyar.sifre);
    if (WiFi.status() == WL_CONNECTED) {
      DEBUG_PRINTF("📶 STA IP: %s\n", WiFi.localIP().toString().c_str());
    } else {
      DEBUG_PRINTLN("📶 STA: Baglanamadi");
    }
  } else {
    DEBUG_PRINTLN("📶 STA: Tanimli degil");
  }
  DEBUG_PRINTF("🌐 mDNS: %s.local\n", host.c_str());
  DEBUG_PRINTF("🔧 OTA Host: %s\n", host.c_str());
  DEBUG_PRINTF("🔧 OTA Sifre: %s\n", OTA_PASSWORD);
  DEBUG_PRINTF("🔧 OTA Port: 3232\n");
  DEBUG_PRINTF("🌍 Web: http://%s.local\n", host.c_str());
  DEBUG_PRINTF("🌍 Web AP: %s\n", WiFi.softAPIP().toString().c_str());
  DEBUG_PRINTLN("========================================\n");
}

