Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
// ============ LOOP ============
void loop() {
  ArduinoOTA.handle(); server.handleClient();

  // AP her zaman acik olmali (STA baglantisindan bagimsiz). Nadiren heap
  // parcalanmasi/RF sorunu ile AP dusebiliyor - periyodik kontrol edip
  // gerekirse yeniden baslatiyoruz.
  static unsigned long sonApKontrolMs = 0;
  unsigned long simdiMs = millis();
  if (simdiMs - sonApKontrolMs >= 30000UL) {
    sonApKontrolMs = simdiMs;
    if (!(WiFi.getMode() & WIFI_AP)) {
      DEBUG_PRINTLN("[WIFI] AP kapaliydi, yeniden baslatiliyor");
      WiFi.mode(WIFI_AP_STA);
      WiFi.softAP(WIFI_AP_SSID, WIFI_AP_PASSWORD, WIFI_AP_CHANNEL, WIFI_AP_HIDDEN);
    }
  }

  // RTC bagliliğini periyodik yeniden dene. Sadece setup()'ta bir kez
  // denenirse, boot anindaki gecici bir I2C hazirsizlik/gecikme sorunu
  // rtcHazir'i kalici olarak false'ta biraktiriyordu - sonraki reboot'a
  // kadar hicbir zaman duzelmiyordu ("bazen calisiyor bazen calismiyor"
  // davranisinin sebebi buydu). Simdi 30sn'de bir tekrar denenir.
  static unsigned long sonRtcDenemeMs = 0;
  if (!rtcHazir && simdiMs - sonRtcDenemeMs >= 30000UL) {
    sonRtcDenemeMs = simdiMs;
    Wire.begin(RTC_SDA, RTC_SCL);
    if (rtc.begin()) {
      rtcHazir = true;
      DEBUG_PRINTLN("[RTC] Yeniden baglanildi");
    }
  }

  // FIX: WiFi koparsa mDNS'i yeniden baslat (STA modu icin)
  if (strlen(wifiAyar.ssid) > 0) {
    if (WiFi.status() == WL_CONNECTED && !mdnsAktif) {
      String host = mdnsHostname();
      if (MDNS.begin(host.c_str())) {
        MDNS.addService("http", "tcp", 80);
        mdnsAktif = true;
        DEBUG_PRINTF("[mDNS] Yeniden baslatildi: %s.local\n", host.c_str());
      }
    } else if (WiFi.status() != WL_CONNECTED) {
      mdnsAktif = false;
    }
  }

  MDNS.update();
  nanoPoll();
  server.handleClient();  // FIX: Bloklayıcı nanoPoll sonrası web isteklerini işle
  rs485KomutDinle();
  server.handleClient();  // FIX: RS485 dinleme sonrası web isteklerini işle
  // ALARM KONTROLÜ - nanoMesgul kontrolü blink'i önler (komut beklerken yeni gönderme)
  if (!nanoMesgul) {
    // PANIK MODU - toggle, sürekli komut gönderme (her seyin onunde, mod/susturma etkilemez)
    if (panicRoleAktif) {
      alarmTetikleyenMask = 0; // panikte sensor tetikleyicisi yok, elle acildi
      alarmCikisLambaIstenen = true; // panikte her zaman hem siren hem lamba
      sirenEpisodeBaslangicMs = 0; sirenFaz = 0; sirenFazBaslangicMs = 0; lambaSurekliBaslangicMs = 0; // panik kademeli zamanlama desenini atlar - sonraki normal tetiklenme sifirdan baslasin
      if (!roleFizikselDurum) nanoRoleKontrol(true);
    } else if (!ayar.alarmRoleAktif) {
      // Alarm sistemi kapali: hicbir tetikleyici sirene/roleye yansimamali
      alarmSusturuldu = false; alarmOnayBekliyor = false; alarmOnaylandi = false; alarmOnaySadeceLamba = false;
      alarmTetikleyenMask = 0;
      alarmCikisLambaIstenen = false;
      sirenEpisodeBaslangicMs = 0; sirenFaz = 0; sirenFazBaslangicMs = 0; lambaSurekliBaslangicMs = 0;
      if (roleFizikselDurum) nanoRoleKontrol(false);
    } else {
      // Zaman bazli (gunduz/gece) VE secili modun kendi senaryosu (hangi sensorler
      // bu modu tetikler) birlikte degerlendirilir.
      uint8_t zamanMask = geceModuMu() ? ayar.alarmTriggerGece : ayar.alarmTriggerGunduz;
      uint8_t modMask;
      switch (ayar.alarmMod) {
        case ALARM_MOD_SESSIZ: modMask = ayar.alarmMaskSessiz; break;
        case ALARM_MOD_ONAYLI: modMask = ayar.alarmMaskOnayli; break;
        default:                modMask = ayar.alarmMaskSesli; break;
      }
      // alarmSensorEtkin: mod/zamandan BAGIMSIZ genel ac/kapa - kablosuz/arizali
      // bir sensoru buradan tamamen devre disi birakmak icin (kullanici talebi,
      // Konteyner Zonu'ndaki sensor anahtarlariyla ayni mantik).
      uint8_t mask = zamanMask & modMask & ayar.alarmSensorEtkin;
      bool triggerActive = false;
      uint8_t tetikleyenMask = 0;
      if ((mask & ALARM_TRIGGER_KAPI1) && kapi1Acik) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_KAPI1; }
      if ((mask & ALARM_TRIGGER_KAPI2) && kapi2Acik) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_KAPI2; }
      if ((mask & ALARM_TRIGGER_PIR) && pirTetikleyici) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_PIR; }
      if ((mask & ALARM_TRIGGER_SU_SEVIYE) && alarmAktif) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_SU_SEVIYE; }
      if ((mask & ALARM_TRIGGER_KACAK) && kacakAlarmi) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_KACAK; }
      if ((mask & ALARM_TRIGGER_SENSOR) && sensorHatasi) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_SENSOR; }
      alarmTetikleyenMask = tetikleyenMask;

      bool lambaHedefHam = false; // bu turun ham lamba hedefi - MIN sure asagida uygulanir
      if (!triggerActive) {
        // Tetikleyici temizlendi - susturma/onay durumlari sifirlanir (bir sonraki
        // tetiklenmede modun varsayilan davranisi yeniden gecerli olsun)
        alarmSusturuldu = false; alarmOnayBekliyor = false; alarmOnaylandi = false; alarmOnaySadeceLamba = false;
        sirenEpisodeBaslangicMs = 0; sirenFaz = 0; sirenFazBaslangicMs = 0; lambaSurekliBaslangicMs = 0;
        if (roleFizikselDurum) nanoRoleKontrol(false);
      } else {
        bool sirenSeciliHam; // susturma/chirp'ten BAGIMSIZ, sadece mod/cikis secimine gore siren istenip istenmedigi
        // Sesli/Sessiz modda hangi cikislarin (siren/lamba) aktif olacagi artik
        // kullanicinin Alarm Ayarlari'ndaki "Mod Senaryolari" cikis secimlerinden
        // (ayar.alarmOutputSesli/Sessiz) geliyor - eskiden Sessiz mod icin siren
        // VE lamba sabit/hardcoded kapaliydi, "sadece bildirim" hic gorunmuyordu.
        if (ayar.alarmMod == ALARM_MOD_SESSIZ) {
          sirenSeciliHam = (ayar.alarmOutputSessiz & ALARM_OUTPUT_SIREN) != 0;
          lambaHedefHam = (ayar.alarmOutputSessiz & ALARM_OUTPUT_LAMBA) != 0;
        } else if (ayar.alarmMod == ALARM_MOD_ONAYLI) {
          if (alarmOnaySadeceLamba) {
            sirenSeciliHam = false; lambaHedefHam = true; // sadece lamba flaşörü - siren/role calismaz
          } else if (!alarmOnaylandi) {
            alarmOnayBekliyor = true; sirenSeciliHam = false; lambaHedefHam = false;
          } else {
            // BUG (kullanici talebi): lamba onceden dogrudan sirenIstenen'i
            // (yani susturmayi) izliyordu - Sustur basilinca lamba da
            // sonuyordu. Simdi Sesli/Sessiz ile TUTARLI: susturma SADECE
            // sireni etkiler, lamba eskale surdukce yanmaya devam eder.
            sirenSeciliHam = true; lambaHedefHam = true;
          }
        } else {
          // Sesli mod
          sirenSeciliHam = (ayar.alarmOutputSesli & ALARM_OUTPUT_SIREN) != 0;
          lambaHedefHam = (ayar.alarmOutputSesli & ALARM_OUTPUT_LAMBA) != 0;
        }
        // Su seviyesi dusuk bir guvenlik tehdidi degil (kullanici talebi) -
        // siren/lamba TETIKLEMESIN, sadece banner/mesaj olarak gorunsun.
        // Ayni anda baska bir tetikleyici (kapi/PIR/kacak/sensor) da aktifse
        // o normal siren/lamba davranisini tetiklemeye devam eder.
        if ((tetikleyenMask & ~ALARM_TRIGGER_SU_SEVIYE) == 0) {
          sirenSeciliHam = false;
          lambaHedefHam = false;
        }
        // Kademeli zamanlama deseni (kullanici talebi, "yanlis tetiklerden
        // etkilenmemek icin", Konteyner/ESP32 ile ayni mantik): tetik
        // baslangicindan ayar.sirenGecikmeSaniye sonra kisa ayar.sirenChirpMs'lik
        // bir "chirp" calar, sonra ayar.sirenBeklemeSaniye sessiz kalir - tetik
        // hala suruyorsa ayar.sirenAktifSaniye boyunca SUREKLI calar; bu
        // bekleme/aktif dongusu tetik bitene kadar TEKRARLANIR.
        bool sirenIstenen;
        if (sirenSeciliHam) {
          unsigned long simdiMs = millis();
          if (sirenEpisodeBaslangicMs == 0) {
            sirenEpisodeBaslangicMs = simdiMs;
            sirenFaz = 0;
            sirenFazBaslangicMs = simdiMs;
          }
          unsigned long gecikmeMs = (unsigned long)ayar.sirenGecikmeSaniye * 1000UL;
          unsigned long chirpMs = (unsigned long)ayar.sirenChirpMs;
          unsigned long beklemeMs = (unsigned long)ayar.sirenBeklemeSaniye * 1000UL;
          unsigned long aktifMs = (unsigned long)ayar.sirenAktifSaniye * 1000UL;
          switch (sirenFaz) {
            case 0: // ilk gecikme - sessiz
              sirenIstenen = false;
              if (simdiMs - sirenFazBaslangicMs >= gecikmeMs) { sirenFaz = 1; sirenFazBaslangicMs = simdiMs; }
              break;
            case 1: // chirp
              sirenIstenen = true;
              if (simdiMs - sirenFazBaslangicMs >= chirpMs) { sirenFaz = 2; sirenFazBaslangicMs = simdiMs; }
              break;
            case 2: // bekleme (chirp sonrasi VEYA aktif-periyot sonrasi)
              sirenIstenen = false;
              if (simdiMs - sirenFazBaslangicMs >= beklemeMs) { sirenFaz = 3; sirenFazBaslangicMs = simdiMs; }
              break;
            default: // 3: tam aktif
              sirenIstenen = true;
              if (simdiMs - sirenFazBaslangicMs >= aktifMs) { sirenFaz = 2; sirenFazBaslangicMs = simdiMs; }
              break;
          }
        } else {
          sirenEpisodeBaslangicMs = 0;
          sirenFaz = 0; sirenFazBaslangicMs = 0;
          sirenIstenen = false;
        }
        sirenIstenen = sirenIstenen && !alarmSusturuldu;
        // Sensor arizasi/unutulmus tetiklenmede siren SINIRSIZ calmasin diye
        // EPIZOT BASLANGICINDAN itibaren gecen TOPLAM sure SIREN_MAX_SURE_MS'i
        // asarsa otomatik susturulur (panik haric - panik zaten bu blogun
        // disinda, kendi ayri dalinda). Kademeli zamanlama nedeniyle
        // sirenIstenen bekleme fazlarinda sik sik false oldugundan, olcum
        // "kesintisiz calma" yerine sirenEpisodeBaslangicMs referans alinarak
        // yapilir (aksi halde 2dk'ya asla ulasilamaz).
        if (sirenEpisodeBaslangicMs != 0 && millis() - sirenEpisodeBaslangicMs > SIREN_MAX_SURE_MS) {
          alarmSusturuldu = true;
          sirenIstenen = false;
        }
        if (sirenIstenen && !roleFizikselDurum) nanoRoleKontrol(true);
        else if (!sirenIstenen && roleFizikselDurum) nanoRoleKontrol(false);
      }
      // Lamba MIN sure: Sustur basilsin ya da tetikleyici erken temizlensin,
      // lamba en az LAMBA_MIN_SURE_MS boyunca acik kalmaya devam eder
      // (kullanici talebi: "en az 60sn lambalar yansın").
      if (lambaHedefHam) {
        lambaMinSureBaslangicMs = millis();
        alarmCikisLambaIstenen = true;
      } else if (lambaMinSureBaslangicMs != 0 && millis() - lambaMinSureBaslangicMs < LAMBA_MIN_SURE_MS) {
        alarmCikisLambaIstenen = true;
      } else {
        lambaMinSureBaslangicMs = 0;
        alarmCikisLambaIstenen = false;
      }
      // Lamba MAX sure (kullanici talebi, enerji butcesi): alarm-tetikli
      // lamba kesintisiz LAMBA_MAX_SURE_MS'i (10dk) asarsa zorla soner -
      // siren'deki 2dk oto-sustur deseniyle simetrik. Manuel lamba acma
      // (lambaAcik/toggleLamba) ayri bir kod yolundan gittigi icin
      // alarmCikisLambaIstenen'e hic girmez, bu bloktan etkilenmez.
      if (alarmCikisLambaIstenen) {
        if (lambaSurekliBaslangicMs == 0) lambaSurekliBaslangicMs = millis();
        else if (millis() - lambaSurekliBaslangicMs > LAMBA_MAX_SURE_MS) alarmCikisLambaIstenen = false;
      } else {
        lambaSurekliBaslangicMs = 0;
      }
    }
  }
  alarmLoguKontrolEt();
  // ALARM LAMBA FLASI - role fiziksel olarak tetikliyken (panik dahil) lamba
  // yanip soner; role kapaninca lamba tetiklenmeden onceki durumuna doner.
  // Kendi !nanoMesgul kontrolünü ayrı yapar ki yukarıdaki role komutu
  // kuyruğu meşgul ettiğinde bu döngüde beklesin, bir sonrakinde devam etsin.
  // Lamba, artik yukarida hesaplanan alarmCikisLambaIstenen'e gore yanip
  // sonuyor (mod cikis ayarindan geliyor) - roleFizikselDurum'a bagimli
  // DEGIL, boylece "siren acik, lamba kapali" gibi kombinasyonlar da
  // dogru calisir (eskiden lamba sadece siren fiziksel olarak tetiklenince
  // yanip soner, Sessiz modda hicbir zaman yanmazdi).
  if (alarmCikisLambaIstenen) {
    if (!lambaFlashAktif) {
      lambaFlashAktif = true;
      lambaFlashOncekiManuel = lambaAcik;
      lambaFlashSonDegisimMs = millis();
    } else if (!nanoMesgul && millis() - lambaFlashSonDegisimMs >= LAMBA_FLASH_ARALIK_MS) {
      lambaFlashSonDegisimMs = millis();
      nanoLambaKontrol(!lambaAcik);
    }
  } else if (lambaFlashAktif) {
    // FIX: lambaFlashAktif eskiden burada kosulsuz false yapiliyordu - alarm
    // tam bu anda role kapatma komutuyla (yukarida) ayni donguye denk gelip
    // nanoMesgul mesgul ciktiginda geri donus komutu hic gonderilmiyor ve bir
    // daha da denenmiyordu (lambaFlashAktif zaten false, bu blok tekrar
    // calismiyordu) - lamba flaşin son anindaki (rastgele acik/kapali)
    // durumunda kilitli kaliyordu. Simdi nanoMesgul bosalana kadar her
    // dongude tekrar denenir, basarili gonderilince flag temizlenir.
    if (!nanoMesgul) {
      nanoLambaKontrol(lambaFlashOncekiManuel);
      lambaFlashAktif = false;
    }
  }
  server.handleClient();  // FIX: Röle kontrol sonrası web isteklerini işle
  unsigned long s = millis();
  uint16_t a = geceModuMu() ? ayar.olcumAraligiGece : ayar.olcumAraligiGunduz;
  if (s - sonOtomatikOlcumMs >= (unsigned long)a * 1000UL) { olcumYap(); sonOtomatikOlcumMs = s; ssePush(); server.handleClient(); }
  // SSE periyodik durum guncelleme - onceden 1500ms'de bir moistureOku()
  // (gercek analogRead) cagiriyordu, yani nem sensoru gereksiz sik
  // okunuyordu (yorumun soyledigi "olcum yapmadan sadece durum iter"in
  // aksine). Kullanici istegiyle 4000ms'e yavaslatildi - ekranda hala
  // akici hissettirecek kadar sik, ama analogRead sıklığı ~2.7 kat azaldi.
  static unsigned long sseGonderMs = 0;
  if (s - sseGonderMs >= 4000UL) { sseGonderMs = s; moistureOku(); ssePush(); }
  // KALDIRILDI: Periyodik (1000ms) istem-disi masterGonder() gonderimi.
  // ESP32 zaten kendi 600ms'lik dongusunde GET_STATUS ile surekli soruyor
  // (bkz esp32_master rs485_poll) - bu "yedek" gonderim aslinda ESP32'nin
  // istegiyle SENKRONIZE OLMADAN, paylasilan yari-cift-yonlu RS485 hattina
  // ikinci, kontrolsuz bir vericiydi. ESP32 tarafinda [RS485_TIMING] tani
  // loguyla dogrulandi: SET_LAMBA gibi komutlar bazen tek denemede 40ms'de
  // basariyorken, bazen 1-3 saniyeye (2-3 yeniden deneme) uzuyordu - suresi
  // rastgele degisen bu orunun, iki bagimsiz zamanlayicinin hatta cakismasiyla
  // (bu gonderim + ESP32'nin sorgusu/komutu ayni ana denk gelince) uyustugu
  // gorulmustu. ESP32'nin poll'u zaten 600ms'de bir taze veri getirdigi icin
  // bu "yedek" gereksizdi - kaldirilmasi hem cakismayi hem gecikmeyi azaltmali.
  server.handleClient();
}